Repository: pypi-data/pypi-mirror-372
Catalog: packages/pretix-pix-openpix/pretix_pix_openpix-0.2.0-py3-none-any.whl/pretix_pix_openpix/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Brazilian Pix - OpenPix integration
pt_br: Pix - integração com OpenPix

source: Accept Pix payments with your OpenPix account.
pt_br: Aceitar pagamentos via Pix com sua conta OpenPix.

source: Payment
pt_br: Pagamento

source: Click here for a tutorial on how to obtain the AppID
pt_br: Clique aqui para instruções de como obter o AppID

source: Production
pt_br: Produção

source: Please provide a valid API key. Ensure the selected endpoint is correct for the key provided.
pt_br: Por favor, forneça uma chave de API válida. Garanta que o endpoint selecionado está correto para a chave informada.

source: This payment method will generate a Pix code with order information that your customer can use to make the payment. You need to have a valid account in <a href="https://openpix.com.br/">OpenPix</a> to use this method.
pt_br: Este método de pagamento gerará um código Pix com as informações do pedido que seu cliente poderá usar para efetuar o pagamento. Você precisa ter uma conta válida no <a href="https://openpix.com.br/">OpenPix</a> para usar este método.

source: <br><br><div class="alert alert-warning">Pix payments are only allowed when the event currency is BRL.</div>
pt_br: <br><br><div class="alert alert-warning">Os pagamentos via Pix só serão permitidos quando a moeda do evento for BRL.</div>

source: OpenPix sandbox settings are being used, you can test without actually sending money but you will need a sandbox account configured to use it.
pt_br: Configurações de sandbox do OpenPix sendo utilizadas. Você pode efetuar testes sem manipular dinheiro real, mas você precisa ter uma conta de sandbox configurada para poder utilizá-la.

source: OpenPix production settings are being used, the generated Pix Code will be real and you will actually send money to the configured account if you make the payment.
pt_br: Configurações de produção do OpenPix sendo utilizadas. O código Pix gerado será real e você irá manipular dinheiro real se efetuar o pagamento.

source: An error occurred while generating the Pix Code. Please try again. If the problem persists, contact the event organizers or select another payment method, if available.
pt_br: Ocorreu um erro na geração do código Pix. Por favor, tente novamente. Se o problema persistir, entre em contato com a equipe organizadora do evento ou selecione outro método de pagamento, se disponível.

source: To make the payment, copy and paste the following Pix code into your banking app. {pix_code}
pt_br: Para efetuar o pagamento, copie e cole o código Pix a seguir na sua aplicação bancária. {pix_code}

source: After completing your purchase, we will provide you with a <strong>Pix code</strong> to be used to pay for your order.
pt_br: Após completar sua compra, iremos fornecer um <strong>código Pix</strong> para ser utilizado para efetuar o pagamento do seu pedido.

source: Your order has been successfully received. Make the payment via Pix by scanning the QR Code below or copy and paste the following code into your banking app.
pt_br: Seu pedido foi recebido com sucesso. Efetue o pagamento via Pix escaneando o QR Code a seguir ou copie e cole o código na sua aplicação bancária.

source: We will send you an email as soon as we received your payment.
pt_br: Enviaremos um email assim que recebermos o seu pagamento.
