Repository: pypi-data/pypi-mirror-372
Catalog: packages/momovu/momovu-1.6.6.tar.gz/momovu-1.6.6/src/momovu/locale/*/LC_MESSAGES/momovu-cli.po
Languages: bn, id, ru

source: Preview margins on book PDFs before publication.
bn: প্রকাশনার আগে বই পিডিএফ-এ মার্জিন প্রিভিউ করুন।
id: Pratinjau margin pada PDF buku sebelum publikasi.
ru: Предварительный просмотр полей в PDF книг перед публикацией.

source: Example: momovu --num-pages 300 --document cover book.pdf
bn: উদাহরণ: momovu --num-pages 300 --document cover book.pdf
id: Contoh: momovu --num-pages 300 --document cover buku.pdf
ru: Пример: momovu --num-pages 300 --document cover book.pdf

source: Enable debug logging
bn: ডিবাগ লগিং সক্রিয় করুন
id: Aktifkan pencatatan debug
ru: Включить отладочное логирование

source: Increase output verbosity (can be used multiple times)
bn: আউটপুট বিস্তারিততা বৃদ্ধি করুন (একাধিকবার ব্যবহার করা যেতে পারে)
id: Tingkatkan verbositas keluaran (dapat digunakan beberapa kali)
ru: Увеличить подробность вывода (можно использовать несколько раз)

source: Show version and exit
bn: সংস্করণ দেখান এবং প্রস্থান করুন
id: Tampilkan versi dan keluar
ru: Показать версию и выйти

source: Set number of pages for spine calculations (must be positive)
bn: মেরুদণ্ড গণনার জন্য পৃষ্ঠা সংখ্যা সেট করুন (ধনাত্মক হতে হবে)
id: Atur jumlah halaman untuk perhitungan punggung buku (harus positif)
ru: Установить количество страниц для расчёта корешка (должно быть положительным)

source: Set document type for margin calculations (interior, cover, dustjacket)
bn: মার্জিন গণনার জন্য ডকুমেন্ট টাইপ সেট করুন (অভ্যন্তরীণ, কভার, ডাস্টজ্যাকেট)
id: Atur jenis dokumen untuk perhitungan margin (interior, sampul, sampul pelindung)
ru: Установить тип документа для расчёта полей (внутренний блок, обложка, суперобложка)

source: Jump to page number (interior documents only)
bn: পৃষ্ঠা নম্বরে যান (শুধুমাত্র অভ্যন্তরীণ নথি)
id: Lompat ke nomor halaman (hanya dokumen interior)
ru: Перейти к номеру страницы (только внутренние документы)

source: Enable side-by-side dual page view mode
bn: পাশাপাশি দ্বৈত পৃষ্ঠা দেখার মোড সক্রিয় করুন
id: Aktifkan mode tampilan halaman ganda berdampingan
ru: Включить режим просмотра двух страниц рядом

source: Show safety margins (default: enabled)
bn: নিরাপত্তা মার্জিন দেখান (ডিফল্ট: সক্রিয়)
id: Tampilkan margin keamanan (default: diaktifkan)
ru: Показать поля безопасности (по умолчанию: включено)

source: Show trim lines (default: enabled)
bn: ট্রিম লাইন দেখান (ডিফল্ট: সক্রিয়)
id: Tampilkan garis potong (default: diaktifkan)
ru: Показать линии обреза (по умолчанию: включено)

source: Show barcode area for cover/dustjacket (default: enabled)
bn: কভার/ডাস্টজ্যাকেটের জন্য বারকোড এলাকা দেখান (ডিফল্ট: সক্রিয়)
id: Tampilkan area barcode untuk sampul/sampul pelindung (default: diaktifkan)
ru: Показать область штрих-кода для обложки/суперобложки (по умолчанию: включено)

source: Show fold lines for cover/dustjacket (default: enabled)
bn: কভার/ডাস্টজ্যাকেটের জন্য ভাঁজ লাইন দেখান (ডিফল্ট: সক্রিয়)
id: Tampilkan garis lipat untuk sampul/sampul pelindung (default: diaktifkan)
ru: Показать линии сгиба для обложки/суперобложки (по умолчанию: включено)

source: Show bleed lines for cover/dustjacket (default: enabled)
bn: কভার/ডাস্টজ্যাকেটের জন্য ব্লিড লাইন দেখান (ডিফল্ট: সক্রিয়)
id: Tampilkan garis bleed untuk sampul/sampul pelindung (default: diaktifkan)
ru: Показать линии выпуска под обрез для обложки/суперобложки (по умолчанию: включено)

source: Show gutter margin for interior documents (default: enabled)
bn: অভ্যন্তরীণ নথির জন্য গাটার মার্জিন দেখান (ডিফল্ট: সক্রিয়)
id: Tampilkan margin jilid untuk dokumen interior (default: diaktifkan)
ru: Показать поле переплёта для внутренних документов (по умолчанию: включено)

source: Start in presentation mode
bn: উপস্থাপনা মোডে শুরু করুন
id: Mulai dalam mode presentasi
ru: Запустить в режиме презентации

source: Start in fullscreen mode
bn: পূর্ণ স্ক্রিন মোডে শুরু করুন
id: Mulai dalam mode layar penuh
ru: Запустить в полноэкранном режиме

source: Path to the PDF file to preview margins for
bn: মার্জিন প্রিভিউ করার জন্য পিডিএফ ফাইলের পথ
id: Jalur ke file PDF untuk pratinjau margin
ru: Путь к PDF-файлу для предварительного просмотра полей

source: --num-pages must be a positive integer
bn: --num-pages একটি ধনাত্মক পূর্ণসংখ্যা হতে হবে
id: --num-pages harus berupa bilangan bulat positif
ru: --num-pages должно быть положительным целым числом

source: --jump can only be used with interior documents
bn: --jump শুধুমাত্র অভ্যন্তরীণ নথির সাথে ব্যবহার করা যেতে পারে
id: --jump hanya dapat digunakan dengan dokumen interior
ru: --jump можно использовать только с внутренними документами
