Repository: pypi-data/pypi-mirror-372
Catalog: packages/momovu/momovu-1.6.5.tar.gz/momovu-1.6.5/src/momovu/locale/*/LC_MESSAGES/momovu-cli.po
Languages: ar, es, ko, zh

source: Preview margins on book PDFs before publication.
ar: معاينة الهوامش في ملفات PDF للكتب قبل النشر.
es: Vista previa de márgenes en PDFs de libros antes de la publicación.
ko: 출판 전 책 PDF의 여백을 미리 봅니다.
zh: 出版前预览书籍PDF的页边距。

source: Example: momovu --num-pages 300 --document cover book.pdf
ar: مثال: momovu --num-pages 300 --document cover book.pdf
es: Ejemplo: momovu --num-pages 300 --document cover libro.pdf
ko: 예시: momovu --num-pages 300 --document cover book.pdf
zh: 示例：momovu --num-pages 300 --document cover book.pdf

source: Enable debug logging
ar: تفعيل سجل تصحيح الأخطاء
es: Habilitar registro de depuración
ko: 디버그 로깅 활성화
zh: 启用调试日志

source: Increase output verbosity (can be used multiple times)
ar: زيادة تفصيل المخرجات (يمكن استخدامه عدة مرات)
es: Aumentar la verbosidad de salida (se puede usar varias veces)
ko: 출력 상세도 증가 (여러 번 사용 가능)
zh: 增加输出详细程度（可多次使用）

source: Show version and exit
ar: عرض الإصدار والخروج
es: Mostrar versión y salir
ko: 버전 표시 후 종료
zh: 显示版本并退出

source: Set number of pages for spine calculations (must be positive)
ar: تحديد عدد الصفحات لحسابات كعب الكتاب (يجب أن يكون رقماً موجباً)
es: Establecer número de páginas para cálculos del lomo (debe ser positivo)
ko: 책등 계산을 위한 페이지 수 설정 (양수여야 함)
zh: 设置书脊计算的页数（必须为正数）

source: Set document type for margin calculations (interior, cover, dustjacket)
ar: تحديد نوع المستند لحسابات الهوامش (داخلي، غلاف، غلاف خارجي)
es: Establecer tipo de documento para cálculos de márgenes (interior, portada, sobrecubierta)
ko: 여백 계산을 위한 문서 유형 설정 (내지, 표지, 더스트재킷)
zh: 设置页边距计算的文档类型（内页、封面、护封）

source: Jump to page number (interior documents only)
ar: الانتقال إلى رقم الصفحة (المستندات الداخلية فقط)
es: Saltar al número de página (solo documentos interiores)
ko: 페이지 번호로 이동 (내지 문서만)
zh: 跳转到页码（仅限内页文档）

source: Enable side-by-side dual page view mode
ar: تفعيل وضع عرض الصفحات المزدوجة جنباً إلى جنب
es: Habilitar modo de vista de página doble lado a lado
ko: 나란히 보기 이중 페이지 보기 모드 활성화
zh: 启用并排双页查看模式

source: Show safety margins (default: enabled)
ar: عرض هوامش الأمان (الافتراضي: مفعّل)
es: Mostrar márgenes de seguridad (predeterminado: habilitado)
ko: 안전 여백 표시 (기본값: 활성화)
zh: 显示安全边距（默认：启用）

source: Show trim lines (default: enabled)
ar: عرض خطوط القص (الافتراضي: مفعّل)
es: Mostrar líneas de corte (predeterminado: habilitado)
ko: 재단선 표시 (기본값: 활성화)
zh: 显示裁切线（默认：启用）

source: Show barcode area for cover/dustjacket (default: enabled)
ar: عرض منطقة الباركود للغلاف/الغلاف الخارجي (الافتراضي: مفعّل)
es: Mostrar área de código de barras para portada/sobrecubierta (predeterminado: habilitado)
ko: 표지/더스트재킷의 바코드 영역 표시 (기본값: 활성화)
zh: 显示封面/护封的条形码区域（默认：启用）

source: Show fold lines for cover/dustjacket (default: enabled)
ar: عرض خطوط الطي للغلاف/الغلاف الخارجي (الافتراضي: مفعّل)
es: Mostrar líneas de plegado para portada/sobrecubierta (predeterminado: habilitado)
ko: 표지/더스트재킷의 접는 선 표시 (기본값: 활성화)
zh: 显示封面/护封的折叠线（默认：启用）

source: Show bleed lines for cover/dustjacket (default: enabled)
ar: عرض خطوط التسييل للغلاف/الغلاف الخارجي (الافتراضي: مفعّل)
es: Mostrar líneas de sangrado para portada/sobrecubierta (predeterminado: habilitado)
ko: 표지/더스트재킷의 재단 여백선 표시 (기본값: 활성화)
zh: 显示封面/护封的出血线（默认：启用）

source: Show gutter margin for interior documents (default: enabled)
ar: عرض هامش التجليد للمستندات الداخلية (الافتراضي: مفعّل)
es: Mostrar margen de encuadernación para documentos interiores (predeterminado: habilitado)
ko: 내지 문서의 제본 여백 표시 (기본값: 활성화)
zh: 显示内页文档的装订边距（默认：启用）

source: Start in presentation mode
ar: البدء في وضع العرض التقديمي
es: Iniciar en modo presentación
ko: 프레젠테이션 모드로 시작
zh: 以演示模式启动

source: Start in fullscreen mode
ar: البدء في وضع ملء الشاشة
es: Iniciar en modo pantalla completa
ko: 전체 화면 모드로 시작
zh: 以全屏模式启动

source: Path to the PDF file to preview margins for
ar: مسار ملف PDF لمعاينة الهوامش
es: Ruta al archivo PDF para previsualizar márgenes
ko: 여백을 미리 볼 PDF 파일 경로
zh: 要预览页边距的PDF文件路径

source: --num-pages must be a positive integer
ar: --num-pages يجب أن يكون عدداً صحيحاً موجباً
es: --num-pages debe ser un entero positivo
ko: --num-pages는 양의 정수여야 합니다
zh: --num-pages 必须是正整数

source: --jump can only be used with interior documents
ar: --jump يمكن استخدامه فقط مع المستندات الداخلية
es: --jump solo se puede usar con documentos interiores
ko: --jump는 내지 문서에서만 사용할 수 있습니다
zh: --jump 只能用于内页文档
