#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time     : 2025/5/29 22:42
# @Author   : songzb

PROMPT_split = """
#### 目标：
你作为一位语言专家，任务是对文本进行分句，分句需要遵循以下的一些规则和策略：
1.进行句子的划分需要保持每一个分句表达的意思是完整。
2.可以参考目标文本表达的意义的标签”actions“进行分句，并且确保分句数量与标签列表中标签的数量一致。
3.如果目标文本只有一个分句，那就只输出原本目标文本就可以。


#### 步骤：
1. **理解文本**：仔细阅读并分析理解目标文本的意义。
2. **进行分句**：对文本进行分句。


#### 要求：
-你的输出格式必须为字符串，分句之间用<sep>连接
-如果目标文本只有一个分句，那就只输出原本目标文本就可以。
-禁止输出解释说明和原因。


### 举例说明：
例子1：
目标文本：你现在还有长痘的情况吗
分句结果：你现在还有长痘的情况吗

例子2：
目标文本：皮肤是否有潮红，丘疹、水疱？
分句结果：皮肤是否有潮红，丘疹、水疱？

例子2：
目标文本：治疗一年多还一直没好吗？现在只有一个是吧？
分句结果：治疗一年多还一直没好吗<sep>现在只有一个是吧？


#### 结果：
目标文本：text
分句结果："""
