Repository: pypi-data/pypi-mirror-372
Catalog: packages/geovisio/geovisio-2.10.0-py3-none-any.whl/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: de, hu, ja

source: Simple 360° geolocated pictures hosting
de: Einfaches Hosting von geo-lokalisierten Fotos
hu: Földrajzilag lokalizált 360°-os képek egyszerű tárolása
ja: ジオタグ付き写真の簡単なホスティング

source: Full page version
de: Vollbildversion
hu: Teljes oldalas változat
ja: 全ページバージョン

source: Viewer
de: Betrachter
hu: Nézegető
ja: 閲覧者

source: Embed pre-configured viewer
de: Vorkonfigurierten Betrachter einbetten
hu: Előre konfigurált nézegető beágyazása
ja: 事前設定されたビューアを埋め込む

source: Easiest way to have a working GeoVisio viewer on your website
de: Die einfachste Methode um den GeoVisio-Betrachter auf ihrer Webseite einzubinden
hu: Ez a legegyszerűbb módja annak, hogy működő GeoVisio nézegető legyen a weboldalán
ja: GeoVisio ビューアを Web サイトに埋め込む最も簡単な方法

source: Use JS library
de: Verwenden der JS Bibliothek
hu: JS könyvtár használata
ja: JSライブラリを使用する

source: A completely configurable viewer for your website
de: Ein komplett konfigurierbarer Betrachter für ihre Webseite
hu: Teljesen konfigurálható nézegető, a te weboldaladhoz is
ja: あなたのウェブサイトのための完全に設定可能なビューア

source: Pictures viewer
de: Bildbetrachter
hu: Képnézegető
ja: 画像ビューア

source: API docs
de: API Dokumentation
hu: API dokumentáció
ja: APIドキュメント

source: JS library docs
de: Dokumentation der JS-Bibliothek
hu: JS könyvtár dokumentáció
ja: JS ライブラリドキュメント

source: You need to enable JavaScript to run this app.
de: JavaScript muss aktiviert sein um diese Applikation zu verwenden.
hu: Az alkalmazás futtatásához engedélyezned kell a JavaScriptet.
ja: このアプリを実行するには、JavaScript を有効にする必要があります。

source: Authentication is mandatory
de: Authentifizierung ist obligatorisch
hu: A hitelesítés kötelező
ja: 認証は必須です

source: Only Bearer token are supported
de: Nur "Bearer-Token" werden unterstützt
hu: Csak a Bearer token támogatott
ja: ベアラートークンのみがサポートされています

source: Invalid '%(format)s' format for image, only the following formats are available: %(allowed_formats)s
de: Ungültiges "%(format)s" Bildformat, es sind nur die folgenden Formate verfügbar: %(allowed_formats)s
hu: Érvénytelen '%(format)s' képformátumú; csak a következő formátumok működnek: %(allowed_formats)s
ja: 画像の '%(format)s' 形式が無効です。使用できる形式は次のものだけです: %(allowed_formats)s

source: Picture can't be found, you may check its ID
de: Foto nicht gefunden, überprüfen sie die ID
hu: A kép nem található, megpróbálhatod ellenőrizni az azonosítóját (ID)
ja: 写真が見つかりません。IDを確認してください

source: Picture is not available (either hidden by admin or processing)
de: Foto ist nicht verfügbar (es ist entweder von einem Admin verborgen oder wird prozessiert)
hu: A kép nem elérhető (vagy a rendszergazda elrejtette, vagy éppen feldolgozás alatt áll)
ja: 画像は利用できません（管理者によって非表示になっているか、処理中です）

source: HD Picture file is not available
de: HD Foto ist nicht verfügbar
hu: A nagy felbontású (HD) képfájl nem elérhető
ja: HD画像ファイルは利用できません

source: Picture derivates file are not available
de: Abgeleitete Fotovarianten sind nicht verfügbar
hu: A képszármazékfájl nem elérhető
ja: 画像派生ファイルは利用できません

source: Unable to read picture on filesystem
de: Konnte die Fotos auf dem Dateisystem nicht lesen
hu: A fájlrendszerben a kép nem olvasható
ja: ファイルシステム内の画像を読み取れません

source: Sort by file date is not possible on this sequence (no file date information available on pictures)
de: Sortieren nach Dateidatum ist nicht möglich für diese Sequenz (keine Datumsinformationen in den Fotos verfügbar)
hu: Ebben a sorozatban nem lehet a fájlokat dátum szerint sorba rendezni (a képeken nem érhető el a fájl dátumára vonatkozó adat)
ja: このシーケンスではファイルの日付による並べ替えはできません (画像にはファイルの日付情報がありません)

source: Sort using %(sort)s is not possible on this sequence, picture %(pic)s is missing mandatory metadata
de: Die Sortierung nach %(sort)s ist nicht möglich für diese Sequenz, Foto %(pic)s fehlen die obligatorischen Metadaten
hu: A %(sort)s szerinti sorba rendezés nem lehetséges ebben a sorozatban, az %(pic)s képről hiányoznak a kötelező metaadatok
ja: このシーケンスでは %(sort)s を使用した並べ替えはできません。画像 %(pic)s には必須のメタデータがありません

source: JWT token signature does not match
de: Signatur des JWT Token stimmt nicht überein
hu: A JWT token aláírása nem egyezik
ja: JWTトークンの署名が一致しません

source: Token does not exist anymore
de: Token existiert nicht mehr
hu: Ez a token már nem létezik
ja: トークンはもう存在しません

source: Token not yet claimed, this token cannot be used yet. Either claim this token or generate a new one
de: Token wurde noch nicht beansprucht und kann noch nicht verwendet werden. Entweder beanspruchen sie den Token oder generieren sie einen neuen
hu: Ezt a tokent még nem igényelték meg, ezért még nem használható. Igényelje meg, vagy generáljon egy újat
ja: トークンはまだ請求されていません。このトークンはまだ使用できません。このトークンを請求するか、新しいトークンを生成してください

source: Unsupported filter parameter
de: Nicht unterstützter Filter-Parameter
hu: Nem támogatott szűrő (filter) paraméter
ja: サポートされていないフィルタパラメータ

source: Impossible to finish authentication flow
de: Konnte Autentifizierungsflow nicht abschliessen
hu: Nem lehet befejezni a hitelesítési folyamatot
ja: 認証フローを完了できません

source: You can try to clear your cookies and retry. If the problem persists, contact your instance administrator.
de: Sie können versuchen ihre Cookies zu löschen und es erneut zu versuchen. Falls das Problem bestehen bleibt, kontaktieren sie den Administrator ihrer Instanz.
hu: Megpróbálhatja törölni a cookie-kat, és újra elindítani a folyamatot. Ha a probléma továbbra is fennáll, lépjen kapcsolatba a Panoramax-példány rendszergazdájával.
ja: クッキーをクリアして再試行してください。問題が解決しない場合は、インスタンス管理者に問い合わせてください。

source: There is no collection created after %(d)s
de: Es gibt keine Sequenz die nach %(d)s erstellt wurde
hu: %(d)s után nem jött létre gyűjtemény
ja: %(d)s 以降に作成されたコレクションはありません

source: There is no collection created before %(d)s
de: Es gibt keine Sequenz die bevor %(d)s erstellt wurde
hu: %(d)s előtt nem jött létre gyűjtemény
ja: %(d)s より前に作成されたコレクションはありません

source: Collection doesn't exist
de: Kollektion existiert nicht
hu: A gyűjtemény nem létezik
ja: コレクションが存在しません

source: Impossible to find a thumbnail for the collection
de: Konnte kein Vorschaubild für die Kollektion finden
hu: Nem lehet megtalálni a gyűjtemény bélyegképét
ja: コレクションのサムネイルが見つかりません

source: Picture visibility parameter (visible) should be either unset, true or false
de: Einstellung für die Sichtbarkeit des Fotos ("visible") muss entweder leer sein oder "true" oder "false" sein
hu: A kép láthatósági paraméterének (visible) lehetséges értékei: nem beállított, igaz vagy hamis (unset, true, false)
ja: 画像の表示パラメータ（visible）は、未設定、true、またはfalseのいずれかである必要があります

source: Sequence title is not valid, should be a string with a max of 250 characters
de: Sequenztitel ist invalide, sollte ein String mit maximal 250 Zeichen sein
hu: A sorozat címe nem érvényes: egy legfeljebb 250 darabból álló karakterláncnak kell lennie

source: Sort order parameter is invalid
de: Parameter für Sortierreihenfolge ist invalide
hu: A sorba rendezés (order) paramétere érvénytelen
ja: 並べ替え順序パラメータが無効です

source: Relative heading is not valid, should be an integer in degrees from -180 to 180
de: Relative Richtung ist invalide, sollte ein Integer in Grad zwischen -180 und 180 sein
hu: A relatív irány nem érvényes, egész számnak kell lennie -180 és 180 fok között
ja: 相対方位が無効です。-180 度から 180 度までの整数で指定してください

source: Sequence %(c)s wasn't found in database
de: Sequenz %(c)s wurde nicht in der Datenbank gefunden

source: You're not authorized to edit this sequence
de: Sie sind nicht autorisiert diese Sequenz zu editieren
hu: Nincs jogosultságod a sorozat szerkesztésére

source: Sequence %(c)s is in %(s)s state, its visibility can't be changed for now
de: Sequenz %(c)s ist im Status %(s)s, die Sichtbarkeit kann zur Zeit nicht geändert werden
hu: %(c)s sorozat állapota %(s)s, ezért láthatósága egyelőre nem módosítható
ja: シーケンス %(c)s は %(s)s 状態です。現時点では可視性を変更できません

source: Collection %(c)s wasn't found in database
de: Sequenz %(c)s wurde nicht in der Datenbank gefunden
hu: %(c)s gyűjtemény nem található az adatbázisban
ja: コレクション %(c)s がデータベースに見つかりませんでした

source: Sequence doesn't exists
de: Sequenz existiert nicht

source: Impossible to find user %(u)s
de: Konnte Nutzer %(u)s nicht finden
hu: %(u)s felhasználót nem lehet megtalálni
ja: ユーザー %(u)s が見つかりません

source: No data loaded for user %(u)s
de: Keine Daten für Nutzer %(u)s gefunden
hu: %(u)s felhasználónak nincs betöltött adata
ja: ユーザー %(u)s のデータが読み込まれませんでした

source: No matching sequences found
de: Keine passende Sequenzen gefunden
hu: Nem található megfelelő sorozat
ja: 一致するシーケンスが見つかりません

source: limit parameter should be an integer between 1 and 10000
de: Limit-Parameter sollte eine ganze Zahl zwischen 1 und 10000 sein
hu: a korlátozó (limit) paraméternek 1 és 10000 közötti egész számnak kell lennie
ja: 「limit」パラメータは1から10000までの整数である必要があります

source: limit parameter should be a valid, positive integer (between 1 and 10000)
de: Limit-Parameter sollte eine valide, positive ganze Zahl sein (zwischen 1 und 10000)
hu: a korlátozó (limit) paraméternek 1 és 10000 közötti érvényes pozitív egész számnak kell lennie
ja: 「limit」パラメータは有効な整数（1～10000）である必要があります

source: `startAfterRank` and `withPicture` are mutually exclusive parameters
de: `startAfterRank` und `withPicture` schliessen sich einander als Parameter aus
hu: a `startAfterRank` és a `withPicture` egymást kölcsönösen kizáró paraméter
ja: `startAfterRank` と `withPicture` パラメータは一緒に使用できません

source: startAfterRank parameter should be a positive integer (starting from 1)
de: startAfterRank-Parameter sollte ein positiver Integer sein (beginnend bei 1)
hu: a `startAfterRank` paraméternek (1-től kezdődő) pozitív egész számnak kell lennie
ja: 「startAfterRank」パラメータは正の整数（1以上）である必要があります

source: startAfterRank parameter should be a valid, positive integer
de: startAfterRank sollte ein valider, positiver Integer sein
hu: a `startAfterRank` paraméternek érvényes, pozitív egész számnak kell lennie
ja: 「startAfterRank」パラメータは正の整数でなければなりません

source: No more items in this collection (last available rank is %(r)s)
de: Keine weiteren Items in dieser Sequenz (letzter verfügbarer Rank ist %(r)s)
hu: Nincs több elem a gyűjteményben (az utolsó elérhető rangsorhely %(r)s)
ja: このコレクションにはこれ以上アイテムはありません (最後の利用可能なランクは %(r)s です)

source: Picture with id %(p)s does not exist
de: Foto mit der ID %(p)s existiert nicht

source: Item doesn't exist
de: Foto existiert nicht
hu: Az elem nem létezik
ja: このアイテムは存在しません

source: Search using POST method should have a JSON body
de: Suchen mit POST als Methode sollte einen JSON-body beinhalten
hu: A POST módszerrel történő keresésnek JSON testtel kell rendelkeznie
ja: POSTメソッドによる検索にはJSONリクエスト本文が必要です

source: Parameter limit must be either empty or a number between 1 and 10000
de: Parameter-Limits müssen entweder leer sein oder zwischen 1 und 10000 liegen
hu: A `limit` paraméternek üresnek vagy 1 és 10000 közötti számnak kell lennie
ja: 「limit」パラメータは空か1から10000までの数値でなければなりません

source: Parameter place_fov_tolerance must be either empty or a number between 2 and 180
de: Parameter place_fov_tolerance muss entweder leer sein oder eine Zahl zwischen 2 und 180
hu: A `place_fov_tolerance` paraméternek üresnek vagy 2 és 180 közötti számnak kell lennie
ja: 「place_fov_tolerance」パラメータは空か2～180の数値でなければなりません

source: Parameter intersects should contain a valid GeoJSON Geometry (not a Feature)
de: Parameter intersects sollte eine valide GeoJSON-Geometrie sein (kein Feature)
hu: Az `intersects` paraméternek érvényes GeoJSON alakzatot kell tartalmaznia (nem Feature-t)
ja: 「intersects」パラメータには有効な GeoJSON ジオメトリ（「Feature」ではない）が含まれている必要があります

source: Parameter ids should be a JSON array of strings
de: Parameter ids sollte ein JSON-Array von Strings sein
hu: Az `ids` paraméternek karakterláncból álló JSON tömbnek kell lennie
ja: 「ids」パラメータは文字列のJSONリストである必要があります

source: Parameter collections should be a JSON array of strings
de: Parameter-Kolletionen sollten ein JSON-Array von Strings sein
hu: A `collections` (gyűjtemények) paraméternek karakterláncból álló JSON tömbnek kell lennie
ja: 「コレクション」パラメータは文字列のJSONリストである必要があります

source: Picture doesn't exist
de: Foto existiert nicht
hu: A kép nem létezik
ja: 写真は存在しません

source: Content type should be multipart/form-data
de: Content type sollte "multipart/form-data" sein
hu: A tartalom típusának (content type) multipart/form-data típusúnak kell lennie
ja: コンテンツ タイプ ("Content-type") は "multipart/form-data" である必要があります

source: Missing "position" parameter
de: Fehlender "position" parameter
hu: Hiányzó `position` paraméter
ja: 「位置」パラメータがありません

source: Position in sequence should be a positive integer
de: Die Position in der Sequenz sollte eine positive, ganzzahlige Zahl sein
hu: A sorozatban elfoglalt pozíciónak (position) pozitív egész számnak kell lennie
ja: シーケンス内の位置は正の整数でなければなりません

source: Longitude cannot be overridden alone, override_latitude also needs to be set
de: Längengrad kann nicht allein überschrieben werden, "override_latitude" muss ebenfalls gesetzt werden
hu: A földrajzi hosszúságot (longitude) önmagában nem lehet felülbírálni, hanem be kell állítani az override_latitude értéket is
ja: 経度のみを上書きすることはできません。「override_latitude」も指定する必要があります

source: Latitude cannot be overridden alone, override_longitude also needs to be set
de: Breitengrad kann nicht alleine überschrieben werden, "override_latitude" muss ebenfalls gesetzt werden
hu: A földrajzi szélességet (latitude) önmagában nem lehet felülbírálni, hanem be kell állítani az override_longitude értéket is
ja: 緯度のみを上書きすることはできません。「override_longitude」も指定する必要があります

source: For parameter `override_longitude`, `%(v)s` is not a valid longitude
de: `%(v)s` ist kein valider Längengrad für den Parameter `override_longitude`
hu: Az `override_longitude` paraméternél `%(v)s` nem érvényes hosszúsági fok
ja: パラメータ `override_longitude` に無効な値 %(v)s があります

source: For parameter `override_latitude`, `%(v)s` is not a valid latitude
de: `%(v)s` ist kein valider Breitengrad für den Parameter `override_latitude`
hu: Az `override_latitude` paraméternél `%(v)s` nem érvényes szélességi fok
ja: パラメータ `override_latitude` に無効な値 %(v)s があります

source: Picture blur status should be either unset, true or false
de: Foto-Unkenntlichmachnung ("blur") sollte entweder nicht gesetzt, "true" oder "false" sein
hu: A kép elhomályosításának állapota (blur status) csak nem beállított, igaz vagy hamis lehet (unset, true, false)
ja: 写真のぼかし状態は空、"true"、または "false" のいずれかである必要があります

source: No picture file was sent
de: Keine Fotos wurden übermittelt
hu: Nem lett elküldve képfájl
ja: 写真ファイルは送信されていません

source: Picture file is either missing or in an unsupported format (should be jpg)
de: Foto-Datei fehlt oder ist in einem nicht-unterstützten Format (sollte JPG sein)
hu: A képfájl vagy hiányzik, vagy nem támogatott formátumú (jpg-nek kell lennie)
ja: 写真ファイルが見つからないか、サポートされていない形式です（JPEGである必要があります）

source: Sequence %(s)s wasn't found in database
de: Sequenz %(s)s wurde nicht in der Datenbank gefunden

source: Picture at given position already exist
de: Foto existiert an dieser Position bereits
hu: Az adott pozíciónál már van kép
ja: この位置の写真はすでに存在します

source: Impossible to parse picture metadata
de: Foto-Metadaten können nicht gelesen werden
hu: Nem lehet elemezni a kép metaadatait
ja: 写真のメタデータを読み取れません

source: Picture wasn't correctly saved in filesystem
de: Foto wurde nicht korrekt im Dateisystem gespeichert
hu: A kép nem megfelelően lett elmentve a fájlrendszerbe
ja: 画像がファイルシステムに正しく保存されませんでした

source: Heading is not valid, should be an integer in degrees from 0° to 360°. North is 0°, East = 90°, South = 180° and West = 270°.
de: Richtig ist nicht valide, sollte eine ganze Zahl in Grad zwischen 0° und 360° sein. Norden=0°, Osten=90°, Süden=180° und Westen=270°.
hu: Az irány nem érvényes, 0° és 360° közötti egész számnak kell lennie. Észak 0°, kelet 90°, dél 180°, nyugat pedig 270°.
ja: 方向 ("heading") が無効です。0 から 360° までの整数である必要があります。北は0°、東は90°、南は180°、西は270°です。

source: Picture %(p)s wasn't found in database
de: Foto %(p)s wurde nicht in der Datenbank gefunden
hu: A %(p)s kép nem található az adatbázisban
ja: 写真 %(p)s はデータベースに見つかりません

source: You're not authorized to edit this picture
de: Sie sind nicht autorisiert dieses Bild zu editieren
hu: Nincs jogosultságod a kép szerkesztéséhez
ja: この写真を編集する権限がありません

source: Picture %(p)s is in %(s)s state, its visibility can't be changed for now
de: Foto %(p)s ist in Status %(s)s, die Sichtbarkeit kann zur Zeit nicht geändert werden
hu: A %(p)s kép %(s)s állapotú, láthatósága ezért egyelőre nem módosítható
ja: 写真 %(p)s は状態「%(s)s」にあり、現時点では表示設定を変更できません

source: One of required parameter is empty
de: Einer der obligatorischen Parameter ist leer
hu: Az egyik szükséges paraméter üres
ja: 必須パラメータの1つが欠落しています

source: Tile format is invalid, should be either pbf or mvt
de: Kachelformat ist invalide, sollte entweder pbf oder mvt sein
hu: A csempeformátum érvénytelen, pbf vagy mvt formátumúnak kell lennie
ja: タイルのフォーマットが無効です。pbf または mvt のいずれかにする必要があります

source: X or Y parameter is out of bounds
de: X- oder Y-Parameter ausserhalb der Grenzwerte
hu: Az X vagy az Y paraméter kívül van a határértéken
ja: XまたはYパラメータが範囲外です

source: Z parameter is out of bounds (should be 0-15)
de: Z-Parameter ist ausserhalb der Grenzwerte (sollte zwischen 0-15 sein)
hu: A Z paraméter kívül van a határértéken (0-15 lehet)
ja: Z パラメータが範囲外です (0 から 15 の間でなければなりません)

source: Impossible to get tile
de: Konnte nicht auf Kachel zugreifen
hu: Nem lehet letölteni a csempét
ja: タイルを取得できません

source: Parameter datetime should contain one or two dates
de: Der Parameter "datetiem" sollte nur ein oder zwei Werte enthalten
hu: A `datetime` paraméternek tartalmaznia kell egy vagy két dátumot
ja: 「datetime」パラメータには1つまたは2つの日付が含まれている必要があります

source: Parameter bbox must contain valid longitude (-180 to 180) and latitude (-90 to 90) values
de: Parameter "bbox" muss valide Längengrade (-180 bis 180) und Breitengrade (-90 bis 90) enthalten
hu: A `bbox` paraméternek érvényes hosszúsági (-180 és 180 között) és szélességi (-90 és 90 között) értéket kell tartalmaznia
ja: 「bbox」パラメータには、有効な経度（-180～180°）と緯度（-90～90°）の値が含まれている必要があります

source: Parameter bbox must be in format [minX, minY, maxX, maxY]
de: Parameter "bbox" muss im Format [minX, minY, maxX, maxY] sein
hu: A `bbox` paraméter elvárt formátuma [minX, minY, maxX, maxY]
ja: 「bbox」パラメータは[minX, minY, maxX, maxY]の形式でなければなりません

source: Parameter %(p)s must be coordinates in lat,lon format
de: Parameter %(p)s muss Koordinaten im lat,lon-Format sein
hu: A `%(p)s` paraméternek lat,lon formátumú koordinátáknak kell lennie
ja: パラメータ「%(p)s」は緯度経度形式の位置でなければなりません

source: Longitude in parameter %(p)s is not valid (should be between -180 and 180)
de: Längengrad in Parameter %(p)s ist nicht valide (sollte zwischen -180 und 180 sein)
hu: A `%(p)s` paraméterben megadott hosszúsági fok nem érvényes (-180 és 180 között kell lennie)
ja: パラメータ「%(p)s」の経度が無効です (-180 ～ 180° の範囲でなければなりません)

source: Latitude in parameter %(p)s is not valid (should be between -90 and 90)
de: Breitengrad in Parameter %(p)s ist nicht valide (sollte zwischen -90 und 90 sein)
hu: A `%(p)s` paraméterben megadott szélességi fok nem érvényes (-90 és 90 között kell lennie)
ja: パラメータ「%(p)s」の緯度が無効です (-90 ～ 90° の範囲でなければなりません)

source: Parameter %(p)s is invalid (should be a distance range in meters like "5-15")
de: Parameter %(p)s ist nicht gültig (sollte eine Distanzspanne in Metern (z.B. "5-15") sein
hu: `%(p)s` paraméter érvénytelen (méterben megadott távolságtartománynak kellene lennie, például "5-15")
ja: パラメータ「%(p)s」は無効です (「5-15」などの距離範囲である必要があります)

source: Parameter %(p)s has a min value greater than its max value
de: Parameter %(p)s hat einen Minimalwert der größer als der Maximalwert ist
hu: `%(p)s` paraméterben a legkisebb (min) érték nagyobb, mint a legnagyobb (max)
ja: パラメータ「%(p)s」の最小値が最大値より大きいです

source: Parameter %(p)s must be a valid list
de: Parameter %(p)s muss eine gültige Liste sein
hu: `%(p)s` paraméternek érvényes listának kell lennie
ja: パラメータ「%(p)s」は有効なリストである必要があります

source: Unsupported sortby parameter: invalid column name
de: Nicht unterstützter "sortby"-Parameter: Ungültiger Spaltenname
hu: Nem támogatott sorba rendezés (`sortby`) paraméter: érvénytelen oszlopnév
ja: 並べ替えパラメータ「sortby」はサポートされていません: 列名が無効です

source: Unsupported sortby parameter: syntax isn't correct
de: Nicht unterstützter "sortby"-Parameter: Syntax ist nicht korrekt
hu: Nem támogatott sorba rendezési (`sortby`) paraméter: a szintaxis nem helyes
ja: 無効なソートパラメータ「sortby」: 構文が正しくありません

source: limit parameter should be a valid, positive integer (between 1 and %(v)s)
de: Limit-Parameter muss ein valider, positiver Integer sein (zwischen 1 und %(v)s)
hu: A `limit` paraméternek érvényes, pozitív egész számnak kell lennie (1 és %(v)s között)
ja: 「limit」パラメータは正の整数（1 から %(v)s まで）である必要があります

source: limit parameter should be an integer between 1 and %(v)s
de: Limit-Parameter sollte ein Integer zwischen 1 und %(v)s sein
hu: A `limit` paraméternek 1 és %(v)s közötti egész számnak kell lennie
ja: 「limit」パラメータは 1 から %(v)s までの数値でなければなりません

source: longitude needs to be between -180 and 180
de: Längengrad muss zwischen -180 und 180 liegen
hu: A földrajzi hosszúságnak (longitude) -180 és 180 között kell lennie
ja: 経度は -180 ～ 180° の範囲でなければなりません

source: latitude needs to be between -90 and 90
de: Breitengrad muss zwischen -90 und 90 liegen
hu: A földrajzi szélességnek (latitude) -90 és 90 között kell lennie
ja: 緯度は -90 ～ 90° の範囲でなければなりません

source: Tiles are not available for flat pictures
de: Kacheln sind nicht verfügbar für flache Fotos
hu: A lapos képekhez nem érhető el csempe
ja: タイルはクラシック写真では利用できません

source: Column parameter is invalid, should be an integer
de: Spaltenparameter ist invalide, sollte ein Integer sein
hu: Érvénytelen az oszlop (`column`) paramétere; egész számnak kellene lennie
ja: パラメータ「column」は無効です。整数である必要があります

source: Column parameter is invalid
de: Spaltenparameter ist invalide
hu: Érvénytelen az oszlop (`column`) paramétere
ja: パラメータ「列」が無効です

source: Row parameter is invalid, should be an integer
de: Zeilenparameter ist invalide, sollte ein Integer sein
hu: Érvénytelen a sor (`row`) paramétere; egész számnak kellene lennie
ja: パラメータ「行」は無効です。整数である必要があります

source: Row parameter is invalid
de: Zeilenparameter ist invalide
hu: Érvénytelen a sor (`row`) paramétere
ja: パラメータ「行」が無効です

source: Sequence "%(name)s" by "%(user)s" was captured on %(date)s.
de: Sequenz "%(name)s" von "%(user)s" wurde am %(date)s aufgenommen.
hu: %(user)s felhasználó %(name)s sorozatát ekkor lett rögzítve: %(date)s.
ja: シーケンス「%(name)s」は「%(user)s」によって%(date)sに取得されました。

source: View on the map
de: Auf Karte ansehen

source: JSON metadata
de: JSON-Metadaten

source: GeoVisio collections
de: GeoVisio-Kollektionen
hu: GeoVisio gyűjtemények
ja: GeoVisio シーケンス

source: List of collections from this GeoVisio server
de: Liste der Sequenzen von diesem GeoVisio-Server
hu: Ezen GeoVisio-kiszolgáló (szerver) gyűjteményeinek listája
ja: この GeoVisio インスタンス内のシーケンスのリスト

source: Impossible to find token
de: Konnte Token nicht finden
hu: Nem lehet megtalálni a tokent
ja: トークンが見つかりません

source: Impossible to generate a new token
de: Konnte keinen neuen Token generieren
hu: Nem lehet új tokent generálni
ja: 新しいトークンを生成できません

source: Token already claimed by another account
de: Token bereits von einem anderen Account verwendet
hu: A tokent már egy másik fiók megigényelte
ja: トークンはすでに別のユーザーアカウントに関連付けられています

source: Impossible to create an UploadSet
de: Konnte UploadSet nicht erstellen
hu: Nem lehet feltöltéskészletet (UploadSet) létrehozni
ja: アップロードセットを作成できません
