Repository: pypi-data/pypi-mirror-372
Catalog: packages/geovisio/geovisio-2.10.0-py3-none-any.whl/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: de, hu, ja

source: Parameter for creating an UploadSet should be a valid JSON
de: Parameter zur Erstellung eines UploadSet sollte valides JSON sein
hu: A feltöltéskészlet (UploadSet) létrehozásához használt paraméternek érvényes JSON-nak kell lennie
ja: UploadSetを作成するためのパラメータは有効なJSONである必要があります

source: UploadSet doesn't exist
de: UploadSet existiert nicht
hu: Ez a feltöltéskészlet (UploadSet) nem létezik
ja: アップロードセットが存在しません

source: Impossible to parse parameters
de: Konnte Parameter nicht einlesen
hu: Nem lehet elemezni a paramétereket
ja: パラメータを解析できません

source: Parameter `override_capture_time` is not a valid datetime, it should be an iso formated datetime (like '2017-07-21T17:32:28Z').
de: Parameter `override_capture_time` ist kein valider Zeitstempel, sollte ein ISO-formatierter Stempel sein (z.B. 2017-07-21T17:32:28Z').
hu: Az `override_capture_time` paraméter nem érvényes dátum. ISO formátumú dátumnak kell lennie (például '2017-07-21T17:32:28Z').
ja: `override_capture_time` パラメータは有効なタイムスタンプではありません。ISO 形式である必要があります (例: '2017-07-21T17:32:28Z')。

source: No file was sent
de: Es wurde keine Datei gesendet
hu: Nem lett elküldve fájl
ja: ファイルは送信されていません

source: UploadSet %(u)s does not exist
de: UploadSet %(u)s existiert nicht
hu: %(u)s feltöltéskészlet (UploadSet) nem létezik
ja: アップロードセット %(u)s は存在しません

source: You're not authorized to add picture to this collection
de: Sie sind nicht autorisiert Bilder zu dieser Sequenz hinzuzufügen
hu: Nincs jogosultságod ehhez a gyűjteményhez képet adni
ja: このシーケンスに写真を追加する権限がありません

source: The upload set is already completed, files cannot be pushed to it
de: Dieses UploadSet ist bereits komplett, Dateien können nicht hinzugefügt werden

source: The item has already been added to this upload set
de: Dieses Item wurde bereits zum UploadSet hinzugefügt
hu: Az elem már hozzá lett adva ehhez a feltöltéskészlethez
ja: アイテムはすでにこのアップロードセットに追加されています

source: The same picture has already been sent in a past upload
de: Dieses Item wurde bereits zu anderen UploadSets hinzugefügt
hu: Ugyanezt a képet már elküldték egy korábbi feltöltés során
ja: 同じ写真がすでに過去のアップロードで送信されています

source: UploadSet doesn't exists
de: UploadSet existiert nicht

source: You're not authorized to complete this upload set
de: Sie sind nicht autorisiert dieses UploadSet zu abzuschliessen
hu: Nincs jogosultságod a feltöltéskészlet befejezésére
ja: このアップロードセットを確定する権限がありません

source: The upload set is already completed, cannot complete it several times for the moment
de: Dieses UploadSet ist bereits abgeschlossen, es kann zur Zeit nicht erneut abgeschlossen werden

source: Impossible to find user
de: Konnte Nutzer nicht finden
hu: Nem lehet megtalálni a felhasználót
ja: ユーザーが見つかりません

source: No search parameter given, you should provide `q=<pattern>` as query parameter
de: Keine Suchanfrage angegeben, sollte als `q=<suchbegriff>` als Parameter angegeben weden
hu: Nincs megadva keresési paraméter. Meg kell adnod egy `q=<pattern>` lekérdezési paramétert
ja: 検索パラメータが指定されていません。検索値として `q=<pattern>` を指定する必要があります

source: No default account defined, please contact your instance administrator
de: Kein Standardaccount definiert, bitte kontaktieren sie den Administrator ihrer Instanz
hu: Nincs alapértelmezett fiók meghatározva. Lépj kapcsolatba a Panoramax-példány rendszergazdájával
ja: デフォルトのアカウントが定義されていません。インスタンス管理者に問い合わせてください

source: You're not authorized to add picture to this upload set
de: Sie sind nicht authorisiert Fotos zu diesem Set hinzuzufügen
hu: Nincs jogosultságod képet hozzáadni ehhez a feltöltéskészlethez
ja: このアップロード セットに写真を追加する権限がありません

source: The picture is too similar to another one (nearby and taken almost at the same time)
de: Das Foto ist zu ähnlich mit einem anderen (in der Nähe und zur gleichen Zeit aufgenommen)
hu: A kép túlságosan hasonlít egy másikhoz (közel vannak egymáshoz, és szinte azonos időben készültek)
ja: この写真は他の写真とあまりにも似ています（近くで、ほぼ同時に撮影されたもの）

source: The sent file is not a valid JPEG
de: Die gesendete Datei ist kein valides JPEG
hu: A beküldött fájl nem érvényes JPEG
ja: 送信されたファイルは有効なJPEGではありません

source: The picture has invalid EXIF or XMP metadata, making it impossible to use
de: Das Foto hat invalide EXIF oder XMP Metadaten, sodass es unmöglich ist es zu nutzen
hu: Érvénytelenek a kép EXIF vagy XMP metaadatai, így a kép nem használható
ja: 写真に無効なEXIFまたはXMPメタデータが含まれているため、使用できません

source: Impossible to find excluded area
de: Unmöglich, den ausgeschlossenen Bereich zu finden
hu: Nem lehet megtalálni a kizárt területet
ja: 除外エリアを見つけることができません

source: Something went very wrong, but not due to the picture itself
de: Etwas ist sehr schief gelaufen, aber nicht wegen des Bildes selbst
hu: Valami nagyon félresikerült, de nem a kép miatt
ja: 何か問題が発生しましたが、画像が原因ではありません

source: Picture has invalid metadata
de: Bild hat ungültige Metadaten
hu: Érvénytelenek a kép metaadatai
ja: 画像に無効なメタデータが含まれています

source: You're not authorized to list reports
de: Du bist nicht berechtigt, Berichte aufzulisten
hu: Nincs jogosultságod a jelentések listázására
ja: レポートを一覧表示する権限がありません

source: You must be logged-in as admin to access all excluded areas
de: Du musst als Administrator eingeloggt sein, um auf alle ausgeschlossenen Bereiche zugreifen zu können
hu: Rendszergazdaként kell bejelentkezned, hogy az összes kizárt területhez hozzáférj
ja: すべての除外エリアにアクセスするには、管理者としてログインする必要があります

source: Only authenticated users can access reports
de: Nur authentifizierte Benutzer können auf Berichte zugreifen
hu: Jelentéshez csak hitelesített felhasználó férhet hozzá
ja: 認証された人だけがレポートにアクセスできます

source: Report doesn't exist
de: Der Bericht existiert nicht
hu: A jelentés nem létezik
ja: レポートは存在しません

source: You're not authorized to access this report
de: Du bist nicht berechtigt, auf diesen Bericht zuzugreifen
hu: Nincs jogosultságod a jelentéshez való hozzáférésre
ja: このレポートにアクセスする権限がありません

source: You're not authorized to access all excluded areas
de: Du bist nicht berechtigt, auf alle ausgeschlossenen Bereiche zuzugreifen
hu: Nincs jogosultságod az összes kizárt területhez hozzáférni
ja: すべての除外エリアにアクセスする権限がありません

source: Impossible to create a Report
de: Erstellung eines Berichts nicht möglich
hu: Nem lehet jelentést (report) létrehozni
ja: レポートを作成できません

source: Parameter for creating a Report should be a valid JSON
de: Parameter für die Erstellung eines Berichts sollte ein gültiges JSON sein
hu: A jelentés (`report`) létrehozásához használt paraméternek érvényes JSON-nak kell lennie
ja: レポートを作成するためのパラメータは有効なJSON形式である必要があります

source: Impossible to edit the Report
de: Bearbeitung des Berichts nicht möglich
hu: Nem lehet szerkeszteni a jelentést
ja: レポートを編集できません

source: Parameter for creating an Excluded Area should be a valid JSON
de: Der Parameter für die Erstellung einer Excluded Area sollte ein gültiges JSON sein
hu: A kizárt terület (Excluded Area) létrehozásához használt paraméternek érvényes JSON-nak kell lennie
ja: 除外エリアを作成するためのパラメータは有効なJSONである必要があります

source: You're not authorized to edit this Report
de: Du bist nicht berechtigt, diesen Bericht zu bearbeiten
hu: Nincs jogosultságod a jelentés szerkesztésére
ja: このレポートを編集する権限がありません

source: You must be logged-in as admin to edit excluded areas
de: Du musst als Administrator eingeloggt sein, um ausgeschlossene Bereiche zu bearbeiten
hu: Kizárt terület szerkesztéséhez rendszergazdaként kell bejelentkezned
ja: 除外エリアを編集するには、管理者としてログインする必要があります

source: Impossible to replace all Excluded Areas
de: Unmöglich, alle ausgeschlossenen Bereiche zu ersetzen
hu: Nem lehet az összes kizárt területet helyettesíteni
ja: 除外エリアをすべて置き換えることは不可能

source: Parameter for replacing all Excluded Areas should be a valid JSON
de: Der Parameter zum Ersetzen aller ausgeschlossenen Bereiche sollte ein gültiges JSON sein
hu: Az összes kizárt terület (Excluded Area) cseréjére szolgáló paraméternek érvényes JSON-nak kell lennie
ja: すべての除外エリアを置き換えるためのパラメータは有効なJSONである必要があります

source: The collection has been deleted, impossible to add pictures to it
de: Die Sammlung wurde gelöscht, es ist unmöglich, ihr Bilder hinzuzufügen
hu: A gyűjteményt törölték, nem lehet képet hozzáadni hozzá
ja: シーケンスは削除されているため、画像を追加することはできません

source: You're not authorized to list pictures in this upload set
de: Du bist nicht berechtigt, Bilder in diesem Upload-Set aufzulisten
hu: Ebben a feltöltéskészletben nincs jogosultságod képeket listázni

source: Impossible to open file as image. The only supported image format is jpg.
de: Es ist nicht möglich, die Datei als Bild zu öffnen. Das einzige unterstützte Bildformat ist jpg.
hu: Nem lehet képként megnyitni a fájlt. Az egyetlen támogatott képformátum a jpg.
ja: ファイルを画像として開くことができません。受け入れられる形式は JPEG のみです。

source: You're not authorized to delete this upload set
de: Du bist nicht berechtigt, dieses Upload-Set zu löschen
hu: Nincs jogosultságod a feltöltéskészlet törlésére
ja: このアップロードセットを削除する権限がありません

source: Collection %(s)s wasn't found in database
de: Sammlung %(s)s wurde nicht in der Datenbank gefunden
hu: A %(s)s gyűjtemény nem található az adatbázisban
ja: シーケンス %(s)s はデータベースに見つかりませんでした

source: Impossible to create an Excluded Area
de: Es ist nicht möglich, einen Ausgeschlossenen Bereich zu erstellen
hu: Nem lehet létrehozni kizárt területet
ja: 除外ゾーンを作成できません

source: You must be logged-in as admin to delete excluded areas
de: Du musst als Administrator eingeloggt sein, um ausgeschlossene Bereiche zu löschen
hu: Kizárt terület törléséhez rendszergazdaként kell bejelentkezned
ja: 除外エリアを削除するには、管理者としてログインする必要があります

source: Parameter for editing the Report should be a valid JSON
de: Parameter für die Bearbeitung des Berichts sollte ein gültiges JSON sein
hu: A jelentés (`report`) szerkesztéséhez használt paraméternek érvényes JSON-nak kell lennie
ja: レポートを編集するためのパラメータは有効なJSON形式である必要があります

source: A different picture with the same name has already been added to this uploadset
de: Ein anderes Bild mit dem selben Namen wurde bereits zu diesem Uploadset hinzugefügt
ja: 同じ名前の別の画像がすでにこのアップロードセットに追加されています

source: Parameter `capture_time` is not a valid datetime, it should be an iso formated datetime (like '2017-07-21T17:32:28Z').
de: Parameter `capture_time` ist kein valider Zeitstempel, sollte ISO-formatiert sein (z.B. '2017-07-21T17:32:28Z').
ja: パラメータ `capture_time` は有効な日時ではありません。ISO 形式の日時 ('2017-07-21T17:32:28Z' など) である必要があります。

source: For parameter `longitude`, `%(v)s` is not a valid longitude
de: Parameter `longitude`, `%(v)s` ist kein valider Längengrad
ja: `longitude` パラメータの場合、`%(v)s` は正しい経度ではありません

source: For parameter `latitude`, `%(v)s` is not a valid latitude
de: Parameter `latitude`, `%(v)s` ist kein valider Breitengrad
ja: `latitude` パラメータの場合、`%(v)s` は正しい緯度ではありません

source: Longitude cannot be overridden alone, latitude also needs to be set
de: Längengrad kann nicht alleine überschrieben werden, Breitengrad muss also gesetzt werden
ja: 経度のみを入力することはできません。緯度も入力する必要があります

source: Latitude cannot be overridden alone, longitude also needs to be set
de: Breitengrad kann nicht alleine überschrieben werden, Längengrad muss also gesetzt werden
ja: 緯度だけでは指定できず、経度も指定する必要があります

source: You're not authorized to edit those fields for this sequence. Only the owner can change the visibility and the title
de: Du bist nicht berechtigt, diese Felder für diese Sequenz zu bearbeiten. Nur der Eigentümer kann die Sichtbarkeit und den Titel ändern
ja: このシーケンスのフィールドを編集する権限がありません。表示とタイトルを変更できるのは所有者のみです

source: You're not authorized to edit this sequence, collaborative editing is not allowed
de: Du bist nicht befugt, diese Sequenz zu bearbeiten, gemeinschaftliche Bearbeitung ist nicht erlaubt
ja: このシーケンスを編集する権限がありません。共同編集は許可されていません

source: You're not authorized to edit the visibility of this picture. Only the owner can change this.
de: Du bist nicht berechtigt, die Sichtbarkeit dieses Bildes zu bearbeiten. Nur der Eigentümer kann dies ändern.
ja: この画像の公開設定を編集する権限がありません。所有者のみがこれを変更できます。

source: You're not authorized to edit this picture, collaborative editing is not allowed
de: Du bist nicht befugt, dieses Bild zu bearbeiten, kollaborative Bearbeitung ist nicht erlaubt
ja: この画像を編集する権限がありません。共同編集は許可されていません

source: Page name is not recognized
de: Der Seitenname wird nicht erkannt
ja: ページ名が認識されません

source: Page not available in language %(l)s
de: Seite nicht verfügbar in Sprache %(l)s
ja: このページは言語 %(l)s では利用できません

source: You must be logged-in as admin to edit pages
de: Du musst als Administrator eingeloggt sein, um Seiten zu bearbeiten
ja: ページを編集するには管理者としてログインする必要があります

source: Page content must be HTML (with Content-Type: text/html header set)
de: Der Seiteninhalt muss HTML sein (mit dem Header Content-Type: text/html)
ja: ページコンテンツは HTML である必要があります (Content-Type: text/html ヘッダーが設定されている)

source: Could not update page content
de: Seiteninhalt konnte nicht aktualisiert werden
ja: ページコンテンツを更新できませんでした

source: Could not delete page content
de: Seiteninhalt konnte nicht gelöscht werden
ja: ページコンテンツを削除できませんでした

source: You need to accept the terms of service before uploading any pictures. You can do so by validating them here: %(url)s
de: Bevor du Bilder hochlädst, musst du die Nutzungsbedingungen akzeptieren. Dies kannst du hier tun: %(url)s
ja: 写真をアップロードする前に、利用規約に同意する必要があります。こちらで確認することで同意できます: %(url)s

source: Parameter for creating an annotation should be a valid JSON
de: Parameter um eine Annotation zu erstellen sollte valides JSON sein

source: Impossible to patch annotation, invalid parameters
de: Patchen der Annotation unmöglich, invalide Parameter

source: Annotation %(p)s not found
de: Annotation %(p)s nicht gefunden

source: Parameter for updating an annotation should be a valid JSON
de: Parameter zum Updaten der Annotation sollten valides JSON sein

source: CSV export does not support pagination
de: CSV Export unterstützt keinen seitenweisen Export

source: CSV export does not support filters
de: CSV Export unterstützt keine Filter

source: CSV export does not support sorting by anything but creation date
de: CSV Export unterstützt keine Sortierung außer Erstellungsdatum

source: Unsupported sortby parameter: invalid field
de: Nicht unterstützter Sortierungsparameter: Invalides Feld

source: Impossible to update the UploadSet
de: Updaten des Uploadsets ist nicht möglich

source: Parameter for updating an UploadSet should be a valid JSON
de: Parameter zum aktualisieren des Uploadsets sollte valides JSON sein

source: You are not allowed to update this upload set
de: Sie sind nicht berechtigt dieses Uploadset zu aktualisieren

source: Impossible to create an annotation
de: Annotation kann unmöglich erstellt werden

source: There is already a picture with the same index in the sequence
de: Es gibt bereits ein Bild mit demselben Index in der Sequenz

source: Links
hu: Linkek
ja: リンク

source: Repositories
hu: Tárházak
ja: ソフトウェアリポジトリ
