Repository: pypi-data/pypi-mirror-372
Catalog: packages/momovu/momovu-1.6.5-py3-none-any.whl/momovu/locale/*/LC_MESSAGES/momovu-cli.po
Languages: ja, pt

source: Preview margins on book PDFs before publication.
ja: 出版前に書籍PDFの余白をプレビューします。
pt: Visualizar margens em PDFs de livros antes da publicação.

source: Example: momovu --num-pages 300 --document cover book.pdf
ja: 例: momovu --num-pages 300 --document cover book.pdf
pt: Exemplo: momovu --num-pages 300 --document cover livro.pdf

source: Enable debug logging
ja: デバッグログを有効にする
pt: Ativar registro de depuração

source: Increase output verbosity (can be used multiple times)
ja: 出力の詳細度を上げる（複数回使用可能）
pt: Aumentar verbosidade da saída (pode ser usado várias vezes)

source: Show version and exit
ja: バージョンを表示して終了
pt: Mostrar versão e sair

source: Set number of pages for spine calculations (must be positive)
ja: 背表紙計算用のページ数を設定（正の数である必要があります）
pt: Definir número de páginas para cálculos da lombada (deve ser positivo)

source: Set document type for margin calculations (interior, cover, dustjacket)
ja: 余白計算用の文書タイプを設定（内部、表紙、カバー）
pt: Definir tipo de documento para cálculos de margem (interior, capa, sobrecapa)

source: Jump to page number (interior documents only)
ja: ページ番号へジャンプ（内部文書のみ）
pt: Ir para número de página (apenas documentos interiores)

source: Enable side-by-side dual page view mode
ja: 見開き2ページ表示モードを有効にする
pt: Ativar modo de visualização de página dupla lado a lado

source: Show safety margins (default: enabled)
ja: 安全余白を表示（デフォルト：有効）
pt: Mostrar margens de segurança (padrão: ativado)

source: Show trim lines (default: enabled)
ja: トリムラインを表示（デフォルト：有効）
pt: Mostrar linhas de corte (padrão: ativado)

source: Show barcode area for cover/dustjacket (default: enabled)
ja: 表紙/カバーのバーコード領域を表示（デフォルト：有効）
pt: Mostrar área de código de barras para capa/sobrecapa (padrão: ativado)

source: Show fold lines for cover/dustjacket (default: enabled)
ja: 表紙/カバーの折り線を表示（デフォルト：有効）
pt: Mostrar linhas de dobra para capa/sobrecapa (padrão: ativado)

source: Show bleed lines for cover/dustjacket (default: enabled)
ja: 表紙/カバーの裁ち落とし線を表示（デフォルト：有効）
pt: Mostrar linhas de sangria para capa/sobrecapa (padrão: ativado)

source: Show gutter margin for interior documents (default: enabled)
ja: 内部文書のガター余白を表示（デフォルト：有効）
pt: Mostrar margem de encadernação para documentos interiores (padrão: ativado)

source: Start in presentation mode
ja: プレゼンテーションモードで開始
pt: Iniciar em modo de apresentação

source: Start in fullscreen mode
ja: フルスクリーンモードで開始
pt: Iniciar em modo tela cheia

source: Path to the PDF file to preview margins for
ja: 余白をプレビューするPDFファイルのパス
pt: Caminho para o arquivo PDF para visualizar margens

source: --num-pages must be a positive integer
ja: --num-pagesは正の整数である必要があります
pt: --num-pages deve ser um inteiro positivo

source: --jump can only be used with interior documents
ja: --jumpは内部文書でのみ使用できます
pt: --jump só pode ser usado com documentos interiores
