Repository: pypi-data/pypi-mirror-372
Catalog: packages/L1test/l1test-3.2.1-py3-none-any.whl/thonnycontrib/i18n/locale/*/LC_MESSAGES/l1test.po
Languages: fr_fr

source: Run all tests
fr_fr: Exécuter tous les tests

source: Generate a docstring
fr_fr: Générer une docstring

source: Generate a __main__
fr_fr: Générer un __main__

source: Place the red tests on the top
fr_fr: Placer les tests rouges en haut

source: Resume original order
fr_fr: Reprendre l'ordre original

source: Show only red tests
fr_fr: Afficher uniquement les tests rouges

source: Show all the tests
fr_fr: Afficher tous les tests

source: Expand all functions
fr_fr: Déplier toutes les fonctions

source: Fold all functions
fr_fr: Replier toutes les fonctions

source: Update the font
fr_fr: Mettre à jour la police

source: Increase row height
fr_fr: Augmenter la hauteur de la ligne

source: Decrease row height
fr_fr: Diminuer la hauteur de la ligne

source: Clear
fr_fr: Effacer

source: Executing tests in progress
fr_fr: Exécution des tests en cours

source: No test found !
fr_fr: Aucun test trouvé !

source: Cannot generate the docstring :
fr_fr: Impossible de générer la docstring :

source: Cannot run %s :
fr_fr: Impossible d'exécuter %s :

source: The file "%s" cannot be imported. Please, be sure that the extension of the file is `.py`
fr_fr: Le fichier "%s" ne peut pas être importé. Veuillez vous assurer que l'extension du fichier est `.py`

source: Cannot found the file `%s`
fr_fr: Impossible de trouver le fichier `%s`

source: Error when importing the module "%s":
fr_fr: Erreur lors de l'importation du module "%s":

source: error
fr_fr: erreur

source: Expected
fr_fr: Attendu

source: Got
fr_fr: Obtenu

source: failed
fr_fr: échec

source: was not raised by
fr_fr: n'a pas été levée par

source: Execution succeed
fr_fr: Exécution réussie

source: success
fr_fr: succès

source: No editor found ! Please open an editor before running the tests.
fr_fr: Aucun éditeur trouvé ! Veuillez ouvrir un éditeur avant de lancer les tests.

source: The file is not saved. Consider to save the file before running the tests.
fr_fr: Le fichier n'est pas enregistré. Envisagez d'enregistrer le fichier avant de lancer les tests.

source: The editor is empty!
fr_fr: L'éditeur est vide!

source: The backend is not ready yet !
fr_fr: Le backend n'est pas encore prêt !

source: Waiting for the backend to restart completely ...
fr_fr: En attente du redémarrage complet du backend ...

source: Coudn't restart the backend. Please restart with the 'Stop' button !
fr_fr: Impossible de redémarrer le backend. Veuillez redémarrer avec le bouton 'Stop' !

source: Starting executing tests ...
fr_fr: Démarrage de l'exécution des tests ...

source: passed
fr_fr: succès

source: Tests run
fr_fr: Tests exécutés

source: Success
fr_fr: Succès

source: Failures
fr_fr: Échecs

source: Errors
fr_fr: Erreurs

source: Empty
fr_fr: Vide

source: Generate the docstring automatically after a line break at a function name.
fr_fr: Générer la docstring automatiquement après un saut de ligne au niveau du nom d'une fonction.

source: Import the module executed in the shell.
fr_fr: Importer le module exécuté dans le shell.

source: Fold all function in %s view.
fr_fr: Fermer toutes les fonctions dans la vue %s.

source: Expand only red functions in %s view.
fr_fr: Ouvrir uniquement les fonctions rouges dans la vue %s.

source: Highlight failed tests (only those that throw an exception).
fr_fr: Mettre en évidence les tests échoués (seulement ceux qui génèrent une exception).

source: Place the error view at the bottom of the Thonny IDE (next to the `Shell` view). By default, the error view is placed below the `L1Test` view. Thonny must be restarted after having modified this option.
fr_fr: Placer la vue des erreurs en bas de l'IDE Thonny (à côté de la vue `Shell`). Par défaut, la vue des erreurs est placée sous la vue `L1Test`. Ne pas oublier de redémarrer Thonny après avoir modifié cette option.

source: In case of functions with the same name: execute the code of the function and not the code Python would execute (doctest behaviour)
fr_fr: Cas des fonctions de même nom : exécuter le code de la fonction et non le code que Python exécuterait (fonctionnement à la doctest)
