Repository: pypi-data/pypi-mirror-372
Catalog: packages/aa-charlink/aa_charlink-1.11.0.tar.gz/aa_charlink-1.11.0/charlink/locale/*/LC_MESSAGES/django.po
Languages: it_it

source: Hook import: failed to validate
it_it: Importazione via hook: validazione fallita

source: Hook import: import not found
it_it: Importazione via hook: file di import non trovato

source: Hook import: generic error
it_it: Importazione via hook: errore generico

source: Scopes error. Contact an administrator.
it_it: Errore negli scope. Contatta un amministratore.

source: AFAT Read Fleet
it_it: AFAT Leggi Flotta

source: AFAT Click Tracking
it_it: AFAT Clicca Tracciamento

source: Add Character (default)
it_it: Aggiungi personaggio (predefinito)

source: Corporation Stats
it_it: Statistiche della corporazione

source: Market Manager - Character Login
it_it: Market Manager - Accesso personaggio

source: Market Manager - Corporation Login
it_it: Market Manager - Accesso corporazione

source: Mining Taxes
it_it: Tasse di estrazione

source: Mining Taxes Admin
it_it: Tasse di estrazione - Admin

source: %(corporation)s has been added with %(character)s as sync character. We have started fetching structures and notifications for this corporation and you will receive a report once the process is finished.
it_it: %(corporation)s è stata aggiunta con %(character)s come personaggio per la sincronizzazione. Abbiamo iniziato a scaricare le strutture e le notifiche per questa corporazione e riceverai un rapporto una volta che il processo sarà terminato.

source: %(corporation)s was added as new structure owner by %(user)s.
it_it: %(corporation)s è stata aggiunta come nuovo proprietario delle strutture da %(user)s

source: %s: Structure owner added: %s
it_it: %s: Proprietario della strutture aggiunto: %s

source: %(character)s has been added to %(corporation)s as sync character. You now have %(characters_count)d sync character(s) configured.
it_it: %(character)s è stato aggiunto a %(corporation)s come personaggio per la sincronizzazione. Ora hai %(characters_count)d personaggio(i) per la sincronizzazione configurato(i).

source: %(character)s was added as sync character to %(corporation)s by %(user)s. We now have %(characters_count)d sync character(s) configured.
it_it: %(character)s è stato aggiunto come personaggio per la sincronizzazione di %(corporation)s da %(user)s. Ora abbiamo %(characters_count)d personaggio(i) per la sincronizzazione configurato(i).

source: %s: Character added to: %s
it_it: %s: Personaggio aggiunto a: %s

source: Charlink Imported Apps
it_it: App Importate in Charlink

source: Imported Apps
it_it: App Importate

source: Imported
it_it: Importate

source: Duplicated
it_it: Duplicate

source: Failed to import
it_it: Importazione fallita

source: Missing imports
it_it: Import mancanti

source: Visible:
it_it: Visibile:

source: Default selection:
it_it: Selezione predefinita:

source: Scopes required:
it_it: Scope richiesti:

source: No duplicated apps found.
it_it: Nessuna app duplicata.

source: All apps have been imported successfully.
it_it: Tutte le app sono state importate con successo.

source: No missing imports found.
it_it: Nessun import mancante trovato.

source: Charlink App Audit
it_it: Charlink Revisione dell'Applicazione

source: Links Audit
it_it: Revisione dei collegamenti

source: Character
it_it: Personaggio

source: Main Character
it_it: Personaggio Principale

source: Charlink Audit
it_it: Revisione di Charlink

source: Characters
it_it: Personaggi

source: Character Linking
it_it: Collegamento dei personaggi

source: Login Form
it_it: Form di accesso

source: Linked Characters
it_it: Personaggi collegati

source: Select the apps you want to link from the list. You will be redirected to eveonline website to authenticate and provide the token with all the scopes needed.
it_it: Seleziona le app che vuoi collegare dall'elenco. Sarai reindirizzato al sito web di eveonline per autenticarti e fornire il token con tutti gli scope necessari.

source: Login
it_it: Accesso

source: Corporations
it_it: Corporazioni

source: Apps
it_it: Le app

source: CharLink Admin
it_it: Amministrazione CharLink

source: Search
it_it: Cerca

source: Charlink Search
it_it: Ricerca di Charlink

source: Search results
it_it: Risultati della ricerca

source: Corporation
it_it: Corporazione

source: Main Corporation
it_it: Corporazione principale

source: CharLink User Audit
it_it: Revisione degli utenti di CharLink

source: Invalid request
it_it: Richiesta non valida

source: Invalid form data
it_it: Dati del form non validi

source: Failed to add character to %(field_label)s
it_it: Aggiunta del personaggio a %(field_label)s non riuscita

source: Character successfully added to %(field_label)s
it_it: Personaggio aggiunto con successo a %(field_label)s

source: You do not have permission to view the selected corporation statistics.
it_it: Non hai il permesso di visualizzare le statistiche della corporazione selezionata.

source: You do not have permission to view the selected user statistics.
it_it: Non hai il permesso di visualizzare le statistiche dell'utente selezionato.

source: You do not have permission to view the selected application statistics.
it_it: Non hai il permesso di visualizzare le statistiche dell'applicazione selezionata.

source: App %(app_name)s is now %(ignored)s
it_it: L'applicazione %(app_name)s è ora %(ignored)s

source: ignored
it_it: ignorata

source: visible
it_it: visibile

source: App %(app_name)s is now %(selected)s by default
it_it: L'applicazione %(app_name)s ora è %(selected)s di default

source: selected
it_it: selezionata

source: not selected
it_it: non selezionata
