Repository: pypi-data/pypi-mirror-372
Catalog: packages/dsetool.policy/dsetool_policy-1.0.0-py3-none-any.whl/dsetool/policy/locales/*/LC_MESSAGES/euphorie.po
Languages: cs, el

source: ${action-plan} In the fourth stage of the assessment you can decide what steps you will take to address the risks you have identified previously and what resources this might require. Based on this, a report will be automatically produced in the next step.
cs: ${action-plan} Ve čtvrté fázi hodnocení můžete rozhodnout, jaké kroky podniknete k řešení rizik, která jste dříve identifikovali, a jaké zdroje by to mohlo vyžadovat. Na základe toho se v dalším kroku automaticky vytvoří zpráva.
el: ${action-plan} Στο τέταρτο στάδιο της αξιολόγησης μπορείτε να αποφασίσετε ποια βήματα θα κάνετε για να αντιμετωπίσετε τους κινδύνους που έχετε προσδιορίσει προηγουμένως και τι πόρους μπορεί να απαιτηθούν. Αναλόγως, θα προκύψει αυτόματα μια αναφορά στο επόμενο βήμα.

source: ${evaluation} Here you will be able to determine the level of risk attached to each of the items you identified as 'need to be addressed' in the 'Identification' stage.
cs: ${evaluation} Zde budete moci určit úroveň rizika spojeného s každou z položek, které jste identifikovali jako 'potřeba řešit' v fázi 'Identifikace'.
el: ${evaluation} Εδώ θα είστε σε θέση να καθορίσετε το επίπεδο κινδύνου που σχετίζεται με κάθε ένα από τα στοιχεία που αναγνωρίσατε ως 'πρέπει να αντιμετωπιστούν' στο στάδιο 'Αναγνώριση'.

source: ${identification} OiRA will present a series of potential health and safety hazards or problems that could exist in your workplace. By answering the statements/questions with either yes or no, you state if such hazards or problems are present. You can also decide to leave a question unanswered and thus put it on hold to be answered at a later stage.
cs: ${identification} OiRA vám představí řadu potenciálních zdravotních a bezpečnostních rizik nebo problémů, které by mohly ve vašem pracovišti existovat. Odpovídáním na prohlášení/otázky ano nebo ne uvádíte, zda jsou taková rizika nebo problémy přítomny. Můžete se také rozhodnout nechat otázku nezodpovězenou a tím ji odložit na pozdější etapu.
el: ${identification} Το OiRA θα παρουσιάσει μια σειρά πιθανών κινδύνων για την υγεία και την ασφάλεια ή προβλημάτων που θα μπορούσαν να υπάρχουν στον χώρο εργασίας σας. Απαντώντας στις δηλώσεις / ερωτήσεις με ναι ή όχι, δηλώνετε εάν τέτοιοι κίνδυνοι ή προβλήματα είναι παρόντες. Μπορείτε επίσης να αποφασίσετε να αφήσετε μια ερώτηση αναπάντητη και έτσι να την αναβάλλετε για να απαντηθεί σε μια αργότερη φάση.

source: ${preparation} This gives you an overview of the particular assessment you are about to begin and can allow you to further customise the assessment to the specific nature of your business.
cs: ${preparation} To vám poskytuje přehled o konkrétním hodnocení, které se chystáte začít a umožňuje vám dále přizpůsobit hodnocení konkrétní povaze vašeho podnikání.
el: ${preparation} Αυτό σας δίνει μια επισκόπηση της συγκεκριμένης αξιολόγησης που πρόκειται να ξεκινήσετε και μπορεί να σας επιτρέψει να προσαρμόσετε περαιτέρω την αξιολόγηση στην ειδική φύση της επιχείρησής σας.

source: Answered
cs: Odpovězeno
el: Απαντήθηκε

source: Choice
cs: Volba
el: Επιλογή

source: Content rules: Manage rules
cs: Pravidla obsahu: Spravovat pravidla
el: Κανόνες περιεχομένου: Διαχείριση κανόνων

source: Do I need to prepare?
cs: Musím se připravit?
el: Χρειάζομαι προετοιμασία;

source: Euphorie: Add new RIE Content
cs: Euphorie: Přidat nový obsah RIE
el: Euphorie: Προσθήκη νέου περιεχομένου RIE

source: Euphorie: Delete published content
cs: Euphorie: Smazat publikovaný obsah
el: Euphorie: Διαγραφή δημοσιευμένου περιεχομένου

source: Euphorie: Manage country
cs: Euphorie: Spravovat zemi
el: Euphorie: Διαχείριση χώρας

source: Euphorie: Publish a Survey
cs: Euphorie: Publikovat průzkum
el: Euphorie: Δημοσίευση μιας έρευνας

source: Euphorie: View a Survey
cs: Euphorie: Zobrazit průzkum
el: Euphorie: Προβολή μιας έρευνας

source: How long will it take?
cs: Jak dlouho to bude trvat?
el: Πόσο θα κρατήσει;

source: However, OiRA is designed to be of most value to smaller businesses.
cs: Nicméně, OiRA je navržena tak, aby byla nejvíce prospěšná malým podnikům.
el: Ωστόσο, το OiRA έχει σχεδιαστεί για να είναι πιο χρήσιμο στις μικρότερες επιχειρήσεις.

source: However, you can spend whatever time you have available on an assessment and then return to it when convenient to pick up from the same point you left off.
cs: Nicméně, můžete věnovat jakkoli dostupný čas hodnocení a pak se k němu vrátit, když se to hodí, abyste pokračovali od místa, kde jste skončili.
el: Παρ' όλα αυτά, μπορείτε να αφιερώσετε όσο χρόνο έχετε διαθέσιμο σε μια αξιολόγηση και στη συνέχεια να επιστρέψετε σε αυτήν όταν είναι βολικό για να συνεχίσετε από το σημείο που το αφήσατε.

source: It's impossible to say how long an assessment will take in general as the tools differ according to sectors and countries.
cs: Je nemožné říci, jak dlouho bude hodnocení obecně trvat, protože nástroje se liší podle sektorů a zemí.
el: Είναι αδύνατον να πούμε πόσο θα διαρκέσει γενικά μια αξιολόγηση, καθώς τα εργαλεία διαφέρουν ανάλογα με τους τομείς και τις χώρες.

source: Learn more about the Dangerous Substances eTool
cs: Dozvědět se více o nástroji Dangerous Substances eTool
el: Μάθετε περισσότερα για το Dangerous Substances eTool

source: Maintenance actions
cs: Údržbové akce
el: Ενέργειες συντήρησης

source: Maintenance view
cs: Pohled na údržbu
el: Προβολή συντήρησης

source: Not yet answered
cs: Dosud neodpovězeno
el: Δεν έχει απαντηθεί ακόμη

source: OSHA OiRA customizations for Euphorie
cs: OSHA OiRA úpravy pro Euphorii
el: Προσαρμογές OSHA OiRA για το Euphorie

source: OSHA extra Country fields
cs: OSHA extra pole pro zemi
el: Επιπλέον πεδία χώρας OSHA

source: OSHA extra Survey fields
cs: OSHA extra pole pro průzkum
el: Επιπλέον πεδία έρευνας OSHA

source: OiRA can be used by anyone wishing to assess health and safety-related risks that might exist in their workplace.
cs: OiRA mohou používat všichni, kteří chtějí hodnotit rizika spojená s bezpečností a ochranou zdraví, která by mohla existovat na jejich pracovišti.
el: Το OiRA μπορεί να χρησιμοποιηθεί από οποιονδήποτε επιθυμεί να αξιολογήσει τους κινδύνους που σχετίζονται με την υγεία και την ασφάλεια που μπορεί να υπάρχουν στον χώρο εργασίας τους.

source: OiRA is designed specifically to support them in assessing the risks at work and helping them to produce a documented risk assessment including an action plan tailored to the business's requirements.
cs: OiRA je konkrétně navržena k podpoře při hodnocení rizik na pracovišti a pomáhá jim vytvořit dokumentované hodnocení rizik včetně akčního plánu přizpůsobeného požadavkům firmy.
el: Το OiRA έχει σχεδιαστεί ειδικά για να τους υποστηρίξει στην αξιολόγηση των κινδύνων στην εργασία και να τους βοηθήσει να παράγουν μια τεκμηριωμένη αξιολόγηση κινδύνου, συμπεριλαμβανομένου ενός σχεδίου δράσης προσαρμοσμένου στις απαιτήσεις της επιχείρησης.

source: OiRA stands for Online Interactive Risk Assessment. It is a web-based tool that allows you to perform a health and safety risk assessment of your workplace.
cs: OiRA znamená Online Interactive Risk Assessment. Je to webový nástroj, který umožňuje provést hodnocení rizik týkajících se bezpečnosti a ochrany zdraví na pracovišti.
el: Το OiRA σημαίνει Online Interactive Risk Assessment. Είναι ένα εργαλείο βασισμένο στο διαδίκτυο που σας επιτρέπει να πραγματοποιήσετε αξιολόγηση κινδύνου για την υγεία και την ασφάλεια του χώρου εργασίας σας.

source: OiRA tool reminder
cs: Připomínka nástroje OiRA
el: Υπενθύμιση εργαλείου OiRA

source: Option
cs: Možnost
el: Επιλογή

source: Provide additional OSHA fields
cs: Poskytnout další pole OSHA
el: Παρέχετε επιπλέον πεδία OSHA

source: Recommendation
cs: Doporučení
el: Σύσταση

source: Registering allows you to simply log in at any time to continue previous assessments or to start new ones.
cs: Registrace vám umožňuje jednoduše se kdykoli přihlásit a pokračovat v předchozích hodnoceních nebo začít nové.
el: Η εγγραφή σας επιτρέπει να εισέλθετε απλά ανά πάσα στιγμή για να συνεχίσετε προηγούμενες αξιολογήσεις ή για να ξεκινήσετε νέες.

source: The first thing you will be asked to do when you begin your first risk assessment is to create an OiRA account - this is a simple and quick process.
cs: První věc, kterou budete požádáni, abyste udělali, když začnete své první hodnocení rizik, je vytvoření účtu OiRA - jedná se o jednoduchý a rychlý proces.
el: Το πρώτο πράγμα που θα σας ζητηθεί να κάνετε όταν ξεκινήσετε την πρώτη σας αξιολόγηση κινδύνου είναι να δημιουργήσετε έναν λογαριασμό OiRA - αυτή είναι μια απλή και γρήγορη διαδικασία.

source: There are four main stages to complete in the assessment process:
cs: V procesu hodnocení je třeba dokončit čtyři hlavní etapy:
el: Υπάρχουν τέσσερα κύρια στάδια για την ολοκλήρωση της διαδικασίας αξιολόγησης:

source: What do I have to do?
cs: Co musím udělat?
el: Τι πρέπει να κάνω;

source: What is OiRA (Online Interactive Risk Assessment)?
cs: Co je OiRA (Online Interactive Risk Assessment)?
el: Τι είναι το OiRA (Online Interactive Risk Assessment);

source: Who is the OiRA tool for?
cs: Pro koho je nástroj OiRA určen?
el: Για ποιόν είναι το εργαλείο OiRA;

source: Why do I have to register?
cs: Proč se musím zaregistrovat?
el: Γιατί πρέπει να εγγραφώ;

source: You do not need any kind of specific preparation to start using the tool, however you should take some time to think about who is going to carry out the risk assessment, how workers are going to be involved in the process, etc.
cs: Nemusíte mít žádnou konkrétní přípravu, abyste mohli začít nástroj používat, měli byste si však vyhradit nějaký čas k zamyšlení nad tím, kdo bude hodnocení rizik provádět, jak budou pracovníci zapojeni do procesu atd.
el: Δεν χρειάζεστε κάποιο είδος συγκεκριμένης προετοιμασίας για να ξεκινήσετε τη χρήση του εργαλείου, ωστόσο πρέπει να πάρετε λίγο χρόνο για να σκεφτείτε ποιος θα πραγματοποιήσει την αξιολόγηση κινδύνου, πως θα εμπλέκονται οι εργαζόμενοι στη διαδικασία κ.λπ.

source: You have to make sure to be in possession of a printed, accurate and up-dated risk assessment (at any time).
cs: Musíte se ujistit, že máte vlastnictví tištěného, přesného a aktualizovaného hodnocení rizik (kdykoli).
el: Πρέπει να βεβαιωθείτε ότι βρίσκεστε στην κατοχή μιας εκτυπωμένης, ακριβούς και ενημερωμένης αξιολόγησης κινδύνου (ανά πάσα στιγμή).

source: choice_option_header
cs: Možnost ${number}
el: Επιλογή ${number}

source: choice_recommendation_header
cs: Doporučení ${number}
el: Σύσταση ${number}

source: description_report_completion_threshold
cs: Zadejte prosím procento dokončení, nad které je tato zpráva k dispozici na tomto nástroji. Uživatel nebude moci zobrazit nebo stáhnout zprávu, dokud nebude hodnocení dokončeno do daného procenta. Zadejte “0”, aby byla zpráva vždy k dispozici.
el: Παρακαλώ εισάγετε το ποσοστό ολοκλήρωσης πάνω από το οποίο η αναφορά είναι διαθέσιμη σε αυτό το εργαλείο. Ο χρήστης δεν θα μπορεί να δει ή να κατεβάσει μια αναφορά μέχρι να ολοκληρωθεί η εκτίμηση στο δοθέν ποσοστό. Εισάγετε “0” για να είναι πάντα διαθέσιμη η αναφορά.

source: description_show_immediate_feedback
cs: Po tom, co uživatel vybral možnost pro volbu, zobrazte případná související doporučení před přechodem k další volbě
el: Αφού ο χρήστης έχει επιλέξει μια επιλογή για μια επιλογή, εμφανίζονται οι συσχετισμένες συστάσεις πριν προχωρήσουν στην επόμενη επιλογή

source: email_reminder_intro
cs: Pokud byste chtěli pokračovat v používání tohoto nástroje v pozdějším čase, můžeme vám poslat připomínkový e-mail s odkazem na toto hodnocení.
el: Εάν θα θέλατε να συνεχίσετε τη χρήση αυτού του εργαλείου σε μελλοντικό χρονικό σημείο, μπορούμε να σας στείλουμε ένα email υπενθύμισης με έναν σύνδεσμο για αυτήν την εκτίμηση.

source: email_reminder_main
cs: Toto je vaše připomínka pokračovat ve vašem hodnocení s nástrojem \
el: Αυτή είναι η υπενθύμιση σας για να συνεχίσετε την εκτίμησή σας με το εργαλείο

source: header_email_reminder
cs: Připomenutí e-mailem
el: Email υπενθύμισης

source: header_options
cs: Možnosti
el: Επιλογές

source: header_recommendations
cs: Doporučení
el: Συστάσεις

source: header_register
cs: Registrovat se
el: Εγγραφή

source: help_allow_multiple_options
cs: Pokud je aktivní, jsou zobrazeny zaškrtávací políčka, která umožňují vybrat více než jednu možnost. V opačném případě jsou použita tlačítka pro vynucení jednoho výběru.
el: Εάν είναι ενεργό, εμφανίζονται κουτιά που επιτρέπουν την επιλογή περισσότερων από μία επιλογή. Διαφορετικά, χρησιμοποιούνται ραδιοφωνικά κουμπιά για να επιβάλλουν μία επιλογή.

source: help_enable_email_reminder
cs: Nabídka poslat připomínku e-mailem o tomto nástroji
el: Προσφορά για αποστολή email υπενθύμισης σχετικά με αυτό το εργαλείο

source: help_logo_upload
cs: Logo se objeví na stránce sektoru vaší země. Ujistěte se, že váš obrázek je ve formátu png, jpg nebo gif a neobsahuje žádné speciální znaky. Nové logo se stane viditelným teprve poté, co uložíte své změny a zveřejníte nástroj OiRA.
el: Το λογότυπο θα εμφανίζεται στη σελίδα επισκόπησης του τομέα της χώρας σας. Βεβαιωθείτε ότι η εικόνα σας είναι σε μορφή png, jpg ή gif και δεν περιέχει ιδιαίτερους χαρακτήρες. Το νέο λογότυπο θα γίνει ορατό μόνο αφού έχετε αποθηκεύσει τις αλλαγές σας και δημοσιεύσει το εργαλείο OiRA.

source: help_module_recommendation
cs: Pokud se tento modul používá jako součást nástroje pro inventarizaci, bude tento text doporučení použit jako úvod do zprávy, než budou uvedena jednotlivá doporučení.
el: Εάν αυτή η ενότητα χρησιμοποιείται ως μέρος ενός εργαλείου απογραφής, αυτό το κείμενο σύστασης θα χρησιμοποιηθεί ως εισαγωγή στην αναφορά πριν απαριθμηθούν οι ατομικές συστάσεις.

source: help_password_requirements
cs: Heslo musí mít minimálně 12 znaků a musí obsahovat alespoň jedno malé písmeno, jedno velké písmeno a jedno číslo.
el: Ο κωδικός πρέπει να είναι τουλάχιστον 12 χαρακτήρες και πρέπει να περιέχει τουλάχιστον ένα γράμμα πεζό, ένα γράμμα κεφαλαίο και έναν αριθμό.

source: help_recommendation_text
cs: Text, který bude součástí zprávy
el: Κείμενο που θα περιλαμβάνεται στην αναφορά

source: home_link
cs: Nástěnka
el: Ταμπλό

source: incorrect_login
cs: Vaše přihlašovací jméno a/nebo heslo bylo zadáno nesprávně. Zkontrolujte to a zkuste to znovu, nebo ${request_an_email_reminder}.
el: Το όνομα σύνδεσης και / ή ο κωδικός πρόσβασης που καταχωρήσατε ήταν λανθασμένοι. Ελέγξτε και προσπαθήστε πάλι ή ${request_an_email_reminder}.

source: info_login
cs: Vážený uživateli, abyste mohl využívat nástroj a všechny jeho funkce, musíte se přihlásit.
el: Αγαπητέ χρήστη, προκειμένου να μπορείτε να χρησιμοποιήσετε το εργαλείο και να έχετε όλες τις λειτουργίες, σας ζητείται να εισέλθετε.

source: info_register
cs: Pokud nemáte uživatele, zaregistrujte se prosím nejdříve.
el: Παρακαλώ, αν δεν έχετε χρήστη, εγγραφείτε πρώτα.

source: intro_identification_dsetool
cs: Otázky jsou rozděleny do 3 částí. První část je o identifikaci možných chemických rizik ve vaší společnosti. Druhá část je o rutinách pro řízení chemických rizik. A třetí část je o opatřeních ke snížení chemických rizik.
el: Οι ερωτήσεις χωρίζονται σε 3 μέρη. Το πρώτο μέρος αφορά την εντοπιστική επιθεώρηση χημικών κινδύνων στην εταιρεία σας. Το δεύτερο μέρος αφορά τους κανονισμούς για τη διαχείριση χημικών κινδύνων. Και το τρίτο μέρος αφορά τα μέτρα ελέγχου για τη μείωση των χημικών κινδύνων.

source: label_action_plan
cs: Akční plán
el: Σχέδιο Δράσης

source: label_agree_terms_conditions
cs: Souhlasím s ${link_terms_conditions}
el: Συμφωνώ με τους ${link_terms_conditions}

source: label_allow_multiple_options
cs: Povolit více možností
el: Επιτρέπονται πολλαπλές επιλογές

source: label_data_protection_notice
cs: Oznámení o ochraně dat
el: Ειδοποίηση προστασίας δεδομένων

source: label_edit_organisation
cs: Upravit organizaci
el: Επεξεργασία Οργανισμού

source: label_email
cs: E-mailová adresa
el: Διεύθυνση email

source: label_enable_email_reminder
cs: Povolit připomínku e-mailem?
el: Ενεργοποίηση υπενθύμισης email;

source: label_evaluation
cs: Hodnocení
el: Αξιολόγηση

source: label_first_name_optional
cs: Jméno (volitelné)
el: Όνομα (προαιρετικό)

source: label_forgot_password
cs: Zapomněl jsem heslo
el: Ξέχασα τον κωδικό μου

source: label_identification
cs: Identifikace
el: Αναγνώριση

source: label_keep_logged_in
cs: Zůstaňte přihlášen.
el: Να παραμείνω συνδεδεμένος.

source: label_last_name_optional
cs: Příjmení (volitelné)
el: Επώνυμο (προαιρετικό)

source: label_learn_more
cs: Dozvědět se více
el: Μάθετε περισσότερα

source: label_login
cs: Přihlásit se
el: Σύνδεση

source: label_login_password
cs: Heslo
el: Κωδικός πρόσβασης

source: label_module_recommendation
cs: Doporučení
el: Σύσταση

source: label_new_password
cs: Požadované heslo
el: Επιθυμητός κωδικός

source: label_password_confirm
cs: Heslo znovu
el: Ξανά κωδικός

source: label_preparation
cs: Příprava
el: Προετοιμασία

source: label_recommendation_text
cs: Text
el: Κείμενο

source: label_register_first
cs: registrovat
el: εγγραφή

source: label_report_completion_threshold
cs: Práh dokončení pro dostupnost zprávy
el: Όριο ολοκλήρωσης για τη διαθεσιμότητα της αναφοράς

source: label_report_inventory
cs: Dobré praktiky a pokyny
el: Καλές πρακτικές και καθοδήγηση

source: label_report_inventory_short
cs: Zkrácená zpráva z dotazníku
el: Σύντομη αναφορά ερωτηματολογίου

source: label_send_email_reminder
cs: Poslat připomenutí e-mailem
el: Αποστολή υπενθύμισης email

source: label_show_immediate_feedback
cs: Zobrazit doporučení jako okamžitou zpětnou vazbu
el: Εμφάνιση συστάσεων ως άμεση ανατροφοδότηση

source: label_start_identification
cs: Zahájit identifikaci rizik
el: Ξεκινήστε την Ανίχνευση Κινδύνων

source: label_start_survey
cs: Spustit
el: Εκκίνηση

source: label_start_test_session
cs: Zahájit testovací sezení
el: Ξεκινήστε μια δοκιμαστική συνεδρία

source: message_no_validation_requested
cs: V tuto chvíli není vyžadováno žádné ověření.
el: Δεν ζητείται επαλήθευση αυτή τη στιγμή.

source: navigation_email_reminder
cs: Připomenutí e-mailem
el: Υπενθύμιση email

source: oira_name_line_1
cs: Nebezpečné látky
el: Επικίνδυνες ουσίες

source: oira_name_line_2
cs: eTool
el: eTool

source: register_teaser
cs: Nemáte účet? Pak se prosím nejprve ${register_link}.
el: Δεν έχετε λογαριασμό; Παρακαλώ ${register_link} πρώτα.

source: report_intro_incomplete
cs: Jakmile dokončíte hodnocení alespoň na ${completion_threshold}%, budete moci vytvořit zprávu.
el: Όταν έχετε ολοκληρώσει την εκτίμηση τουλάχιστον κατά ${completion_threshold}% θα μπορέσετε να δημιουργήσετε μια αναφορά.

source: request_an_email_reminder
cs: obnovte své heslo
el: επαναφέρετε τον κωδικό σας

source: text_create_account
cs: ${link_register}, pokud chcete používat OiRA.
el: ${link_register} εάν θα θέλατε να χρησιμοποιήσετε το OiRA.

source: text_test_session
cs: ${link_test_session}, pokud chcete jen ochutnat OiRA.
el: ${link_test_session} εάν θέλετε απλά να δοκιμάσετε το OiRA.

source: tooltip_start_test_session
cs: Zahájit nové testovací sezení
el: Ξεκινήστε μια νέα δοκιμαστική συνεδρία

source: verb_register
cs: Registrace
el: Εγγραφείτε
