Repository: pypi-data/pypi-mirror-372
Catalog: packages/momovu/momovu-1.6.6-py3-none-any.whl/momovu/locale/*/LC_MESSAGES/momovu-cli.po
Languages: de, fr, it, pl, tr

source: Preview margins on book PDFs before publication.
de: Vorschau der Ränder in Buch-PDFs vor der Veröffentlichung.
fr: Aperçu des marges sur les PDF de livres avant publication.
it: Anteprima dei margini sui PDF dei libri prima della pubblicazione.
pl: Podgląd marginesów w plikach PDF książek przed publikacją.
tr: Yayınlanmadan önce kitap PDF'lerinde kenar boşluklarını önizleyin.

source: Example: momovu --num-pages 300 --document cover book.pdf
de: Beispiel: momovu --num-pages 300 --document cover book.pdf
fr: Exemple : momovu --num-pages 300 --document cover livre.pdf
it: Esempio: momovu --num-pages 300 --document cover libro.pdf
pl: Przykład: momovu --num-pages 300 --document cover ksiazka.pdf
tr: Örnek: momovu --num-pages 300 --document cover kitap.pdf

source: Enable debug logging
de: Debug-Protokollierung aktivieren
fr: Activer la journalisation de débogage
it: Abilita registrazione di debug
pl: Włącz rejestrowanie debugowania
tr: Hata ayıklama günlüğünü etkinleştir

source: Increase output verbosity (can be used multiple times)
de: Ausgabeausführlichkeit erhöhen (kann mehrfach verwendet werden)
fr: Augmenter la verbosité de sortie (peut être utilisé plusieurs fois)
it: Aumenta la verbosità dell'output (può essere usato più volte)
pl: Zwiększ szczegółowość wyjścia (można użyć wielokrotnie)
tr: Çıktı ayrıntısını artır (birden çok kez kullanılabilir)

source: Show version and exit
de: Version anzeigen und beenden
fr: Afficher la version et quitter
it: Mostra versione ed esci
pl: Pokaż wersję i wyjdź
tr: Sürümü göster ve çık

source: Set number of pages for spine calculations (must be positive)
de: Seitenzahl für Buchrückenberechnungen festlegen (muss positiv sein)
fr: Définir le nombre de pages pour les calculs du dos (doit être positif)
it: Imposta il numero di pagine per i calcoli del dorso (deve essere positivo)
pl: Ustaw liczbę stron do obliczeń grzbietu (musi być dodatnia)
tr: Sırt hesaplamaları için sayfa sayısını ayarla (pozitif olmalı)

source: Set document type for margin calculations (interior, cover, dustjacket)
de: Dokumenttyp für Randberechnungen festlegen (Innenteil, Umschlag, Schutzumschlag)
fr: Définir le type de document pour les calculs de marges (intérieur, couverture, jaquette)
it: Imposta il tipo di documento per i calcoli dei margini (interno, copertina, sovraccoperta)
pl: Ustaw typ dokumentu do obliczeń marginesów (wnętrze, okładka, obwoluta)
tr: Kenar boşluğu hesaplamaları için belge türünü ayarla (iç, kapak, cilt kapağı)

source: Jump to page number (interior documents only)
de: Zur Seitenzahl springen (nur Innendokumente)
fr: Aller au numéro de page (documents intérieurs uniquement)
it: Vai al numero di pagina (solo documenti interni)
pl: Przejdź do numeru strony (tylko dokumenty wewnętrzne)
tr: Sayfa numarasına git (yalnızca iç belgeler)

source: Enable side-by-side dual page view mode
de: Nebeneinander-Doppelseitenansicht aktivieren
fr: Activer le mode d'affichage double page côte à côte
it: Abilita modalità di visualizzazione doppia pagina affiancata
pl: Włącz tryb widoku dwóch stron obok siebie
tr: Yan yana çift sayfa görünüm modunu etkinleştir

source: Show safety margins (default: enabled)
de: Sicherheitsränder anzeigen (Standard: aktiviert)
fr: Afficher les marges de sécurité (par défaut : activé)
it: Mostra margini di sicurezza (predefinito: abilitato)
pl: Pokaż marginesy bezpieczeństwa (domyślnie: włączone)
tr: Güvenlik kenar boşluklarını göster (varsayılan: etkin)

source: Show trim lines (default: enabled)
de: Schnittlinien anzeigen (Standard: aktiviert)
fr: Afficher les lignes de coupe (par défaut : activé)
it: Mostra linee di taglio (predefinito: abilitato)
pl: Pokaż linie cięcia (domyślnie: włączone)
tr: Kesim çizgilerini göster (varsayılan: etkin)

source: Show barcode area for cover/dustjacket (default: enabled)
de: Barcode-Bereich für Umschlag/Schutzumschlag anzeigen (Standard: aktiviert)
fr: Afficher la zone de code-barres pour couverture/jaquette (par défaut : activé)
it: Mostra area codice a barre per copertina/sovraccoperta (predefinito: abilitato)
pl: Pokaż obszar kodu kreskowego dla okładki/obwoluty (domyślnie: włączone)
tr: Kapak/cilt kapağı için barkod alanını göster (varsayılan: etkin)

source: Show fold lines for cover/dustjacket (default: enabled)
de: Falzlinien für Umschlag/Schutzumschlag anzeigen (Standard: aktiviert)
fr: Afficher les lignes de pliage pour couverture/jaquette (par défaut : activé)
it: Mostra linee di piega per copertina/sovraccoperta (predefinito: abilitato)
pl: Pokaż linie zgięcia dla okładki/obwoluty (domyślnie: włączone)
tr: Kapak/cilt kapağı için katlama çizgilerini göster (varsayılan: etkin)

source: Show bleed lines for cover/dustjacket (default: enabled)
de: Beschnittlinien für Umschlag/Schutzumschlag anzeigen (Standard: aktiviert)
fr: Afficher les lignes de fond perdu pour couverture/jaquette (par défaut : activé)
it: Mostra linee di abbondanza per copertina/sovraccoperta (predefinito: abilitato)
pl: Pokaż linie spadu dla okładki/obwoluty (domyślnie: włączone)
tr: Kapak/cilt kapağı için taşma çizgilerini göster (varsayılan: etkin)

source: Show gutter margin for interior documents (default: enabled)
de: Bundsteg für Innendokumente anzeigen (Standard: aktiviert)
fr: Afficher la marge de reliure pour les documents intérieurs (par défaut : activé)
it: Mostra margine di rilegatura per documenti interni (predefinito: abilitato)
pl: Pokaż margines oprawy dla dokumentów wewnętrznych (domyślnie: włączone)
tr: İç belgeler için cilt payı kenar boşluğunu göster (varsayılan: etkin)

source: Start in presentation mode
de: Im Präsentationsmodus starten
fr: Démarrer en mode présentation
it: Avvia in modalità presentazione
pl: Uruchom w trybie prezentacji
tr: Sunum modunda başlat

source: Start in fullscreen mode
de: Im Vollbildmodus starten
fr: Démarrer en mode plein écran
it: Avvia in modalità schermo intero
pl: Uruchom w trybie pełnoekranowym
tr: Tam ekran modunda başlat

source: Path to the PDF file to preview margins for
de: Pfad zur PDF-Datei für die Randvorschau
fr: Chemin vers le fichier PDF pour l'aperçu des marges
it: Percorso del file PDF per l'anteprima dei margini
pl: Ścieżka do pliku PDF do podglądu marginesów
tr: Kenar boşluklarını önizlemek için PDF dosyasının yolu

source: --num-pages must be a positive integer
de: --num-pages muss eine positive Ganzzahl sein
fr: --num-pages doit être un entier positif
it: --num-pages deve essere un intero positivo
pl: --num-pages musi być dodatnią liczbą całkowitą
tr: --num-pages pozitif bir tam sayı olmalıdır

source: --jump can only be used with interior documents
de: --jump kann nur mit Innendokumenten verwendet werden
fr: --jump ne peut être utilisé qu'avec des documents intérieurs
it: --jump può essere usato solo con documenti interni
pl: --jump może być używany tylko z dokumentami wewnętrznymi
tr: --jump yalnızca iç belgelerle kullanılabilir
