f
d
s
##k
##3
l
##ã
m
u
t
h
a
.
g
##o
##f
n
4
-
##c
o
##°
##y
v
##h
b
0
"
##g
##p
(
5
##x
##i
##q
##t
w
p
,
##d
6
##b
##s
##l
##â
##w
c
##'
##5
##-
q
r
#
1
##/
##e
8
##1
##6
##m
##2
i
##©
##u
##z
##4
j
##&
##r
##n
k
##)
y
##v
2
##j
e
##+
##7
!
##a
##0
[SEP]
[PAD]
[UNK]
[MASK]
[CLS]
##ã©
##â°
##3â°
-5
-5â°
24
##++
27
86
##23â°
(23â°
20
202
2020
##60
6)
##25
##250
##00
500
24/
24/7
##/5
##/60
##1/60
##/1
1/
1/250
##/2
(1/60
f/2
f/5
##bj
(23â°f
(23â°f)
##fã©
##f/1
(f/1
c++
s&
ex
s&p
##p/
#h
##zz
qu
##ubj
subj
##qu
of
off
(v
(p
(m
ju
-5â°c
##cp/
tcp/
exp
##ff
eff
##uzz
puzz
puzzl
th
qub
op
##-p
##f-p
##f-pu
##f-pub
##lf-pub
##lf-publ
(pr
"h
##h'
##o2
co2
(pro
#ha
##afã©
cafã©
##aq
##daq
(ma
##zza
##zzar
##zzard
equ
##th'
(prot
##th's
#has
#hash
#hasht
#hashta
#hashtag
#hashtags
cafã©s
##sdaq
##asdaq
nasdaq
(mas
(mass
##s)
1/250s)
(1/60s
##zzards
e-
e-c
e-co
e-com
e-comm
##-b
qubi
qubit
qubits
tcp/i
tcp/ip
(massi
(massiv
(vi
(vit
(vita
(vitam
(vitami
##lf-publi
##lf-publis
##lf-publish
##lf-publishi
##izzards
##lizzards
blizzards
equi
equil
equili
equilib
equilibr
equilibri
equilibriu
equilibrium
equilibriums
(vitamin
(vitamins
##lf-publishin
##lf-publishing
yo
you
yi
ob
obs
ow
own
qua
uk
in
inf
inqu
inv
if
im
imp
ima
imag
inqui
inquir
inquiry
ev
invo
invol
involv
ov
ja
jav
jac
jack
jo
java
javas
javasc
javascr
jon
javascri
javascrip
javascript
##-m
##-ma
##-mak
##-mar
##-mark
##t-mark
##st-mark
##ost-mark
post-mark
##n-mak
##on-mak
##ion-mak
##sion-mak
##ision-mak
##cision-mak
##cision-maki
##cision-makin
##cision-making
##y-
##gy-
##rgy-
##p-
##p-s
jud
jup
jupi
jupit
jum
jump
jumps
squ
squa
squar
inc
incl
inclu
includ
incr
qual
quan
quant
quantu
quantum
quali
qualit
quality
infl
influ
infla
inflat
inflati
inflatio
inflation
info
infor
inform
infr
infra
infras
infrast
infrastr
infrastru
infrastruc
infrastruct
infrastructu
infrastructur
expl
explo
explor
expla
explai
explain
##hqu
##hqua
##hquak
##thquak
##rthquak
##arthquak
earthquak
jus
jul
just
just-
juli
just-i
just-in
just-in-
##m-
just-in-t
##m-s
##m-so
##m-sol
##m-solv
##-c
##-cu
##-l
##-cul
##t-l
##-cult
##-cultu
##-cultur
##-cultura
##-cultural
##s-cultural
##ss-cultural
##oss-cultural
##ross-cultural
cross-cultural
##it-l
##kit-l
##ikit-l
##cikit-l
scikit-l
just-in-ti
just-in-tim
justi
justic
##m-solvi
##m-solvin
##m-solving
sy
sys
syst
syn
sym
symb
symbo
symbol
symboli
symbolis
symbolism
synt
synth
synta
syntax
syna
synap
synaps
ove
over
jacke
jacket
e-comme
e-commer
e-commerc
e-commerce
syste
system
systems
jone
jones
julie
juliet
involve
involves
scikit-le
scikit-lea
scikit-lear
scikit-learn
synapse
synapses
subje
subjec
subject
subjects
(massive
jupite
jupiter
just-in-time
inve
incre
increa
increas
increase
increases
##ecision-making
decision-making
square
puzzle
synthe
synthes
synthesi
synthesis
infrastructure
##ergy-
##nergy-
energy-
energy-e
energy-eff
energy-effi
energy-effic
energy-effici
energy-efficie
energy-efficien
energy-efficient
yie
yiel
yield
yields
##ep-s
##eep-s
deep-s
deep-se
deep-sea
earthquake
(prote
(protei
(protein
(proteins
##elf-publishing
self-publishing
justice
image
imager
imagery
obse
obser
observ
observa
observat
observati
observatio
observation
influe
influen
influenc
influence
post-marke
post-market
##e-b
##ve-b
##ive-b
##tive-b
##itive-b
##nitive-b
##gnitive-b
##ognitive-b
cognitive-b
cognitive-be
cognitive-beh
cognitive-beha
cognitive-behav
cognitive-behavi
cognitive-behavio
cognitive-behavior
cognitive-behaviora
cognitive-behavioral
##em-solving
##lem-solving
##blem-solving
##oblem-solving
##roblem-solving
problem-solving
ind
indu
indus
indust
industr
industry
indi
indiv
indic
indig
indica
india
indicat
indicato
indicator
indicators
indian
indivi
individ
individu
individua
individual
indige
indigen
indigeno
indigenou
indigenous
hu
hum
hur
hurr
huma
human
hurri
hurric
hurrica
hurrican
hurricane
hurricanes
inves
invest
investm
investo
investor
investors
inven
invent
invento
inventor
inventory
investme
investmen
investment
##g'
##g's
##ng's
##ung's
##sung's
##msung's
##amsung's
samsung's
##iz
##zy
##yz
##lyz
##azy
lazy
##az
##gaz
##maz
amaz
amazo
##agaz
magaz
##alyz
amazon
##nalyz
analyz
##miz
##miza
##mizat
magazi
magazin
##imizat
##timizat
optimizat
optimizati
optimizatio
optimization
##liz
siz
sizi
sizin
sizing
magazine
analyze
analyzes
opp
oppo
oppor
opport
opportu
opportun
opportuni
opportunit
opportuniti
opportunitie
opportunities
##rth's
##arth's
earth's
##ith's
##mith's
smith's
##mp
emp
empl
emplo
employ
employm
empi
empir
empiri
empiric
empirica
empirical
##omp
comp
##comp
##compa
##compas
##compass
compu
comput
##ncompass
encompass
##pp
app
##upp
supp
suppl
supply
suppo
suppor
##ppu
##ppuc
##ppucc
##appucc
cappucc
support
appl
##ppi
##ppin
##pping
##opping
##ropping
dropping
##appin
happin
cappucci
cappuccin
cappuccino
appr
appro
approx
approv
approa
approac
approach
approva
approval
apps
approxi
approxim
approxima
approximat
##mpy
##umpy
numpy
appli
applic
applia
applica
applicat
applian
applianc
applicati
applicatio
application
applications
"m
"ma
"mac
"macb
ip
iph
ipho
iphon
appliance
appliances
apple
apple'
apple's
iphone
"macbe
"macbet
"macbeth
approximate
approximatel
approximately
happine
happines
happiness
approache
approaches
employme
employmen
employment
sp
##ph
##phy
##aphy
##raphy
##graphy
##ography
##aphys
##tography
##ptography
##yptography
##ryptography
cryptography
##taphys
##taphysi
##taphysic
##taphysics
##etaphysics
metaphysics
hy
hyp
hyd
hydr
hydro
hypo
hypot
hypoth
hydroe
hydroel
hydroele
hydroelec
hydroelect
hydroelectr
hydroelectri
hydroelectric
hypothe
hypothes
an
and
anx
aff
id
anxi
ab
affe
affec
affect
affects
ide
iden
ident
identi
identif
identify
identit
identity
identifyi
identifyin
identifying
anxie
anxiet
anxiety
##dw
##ldw
##adw
##oadw
##roadw
broadw
broadwa
broadway
##rldw
##orldw
worldw
##ldwo
##ldwor
##ldwork
worldwi
worldwid
worldwide
##eldwork
##ieldwork
fieldwork
on
oc
##iff
diff
##riff
##ariff
tariff
tariffs
diffe
differ
differe
differen
different
ou
our
or
org
orga
organ
organiz
organiza
organizat
ot
oth
organizati
organizatio
organization
othe
other
##aph
##raph
graph
##graph
##ograph
##mograph
##nograph
##hnograph
##apho
##aphor
##aphors
##thnograph
ethnograph
##taphors
graphi
graphic
graphics
ethnographi
ethnographic
##mographi
##mographic
##emographic
demographic
##etaphors
metaphors
include
includi
includin
including
##gy
##ogy
##logy
##ology
##rgy
##pology
##opology
##ropology
##hropology
##thropology
anthropology
##ergy
##nergy
energy
##egy
##tegy
##ategy
##rategy
##trategy
strategy
##-pl
##-pla
##-play
##-playi
##-playin
##-playing
##e-playing
##le-playing
##ole-playing
role-playing
##r-p
##r-pr
##or-pr
##-pa
##-par
##-part
##tor-pr
##ator-pr
##dator-pr
##-parti
##-partic
##-particl
##e-particl
##ve-particl
##ave-particl
wave-particl
wave-particle
##edator-pr
##redator-pr
predator-pr
predator-pre
predator-prey
##ls)
##als)
##rals)
##erals)
##nerals)
##inerals)
minerals)
##xy
##axy
##laxy
##alaxy
galaxy
abo
abou
about
##off
coff
##aff
##raff
traff
traffi
traffic
coffe
coffee
impo
impor
import
impr
impro
improv
impa
impac
impact
impacts
improve
improvem
improveme
improvemen
improvement
improvements
##otography
##hotography
photography
##atography
##matography
##ematography
##nematography
##inematography
cinematography
effo
effor
effort
efforts
##oph
##soph
##osoph
##losoph
##lph
alph
alpha
alphab
##sph
##osph
##mosph
##tmosph
atmosph
##ilosoph
##hilosoph
philosoph
philosophi
philosophic
philosophica
philosophical
alphabe
alphabet
atmosphe
atmospher
atmospheri
atmospheric
int
inte
inter
integ
interv
intel
intell
interp
integr
interpr
integra
intelli
intellig
interd
intern
intera
interac
interact
interacti
interactio
interaction
interactions
integrat
integral
integrals
intellige
intelligen
intelligenc
intelligence
integrate
interde
interdep
interdepe
interdepen
interdepend
interdepende
interdependen
interdependenc
interdependence
interpre
interpret
##n'
##on'
don'
don't
##in'
##kin'
##nkin'
##unkin'
dunkin'
abi
abil
abs
abili
abilit
abiliti
abilitie
abilities
ope
opt
oper
open
opera
opti
optic
operat
operati
operate
operatio
operatin
operating
operation
operations
##que
##qui
##quir
##equir
requir
require
requires
##ques
##quen
##quenc
##ique
##nique
unique
##equenc
sequenc
sequence
sequences
##iques
##niques
##hniques
##chniques
##quest
##questr
##questra
##questrat
##questrati
##questratio
##questration
##echniques
techniques
##equestration
sequestration
co
ch
com
comb
comm
commu
commo
commod
commun
communi
commodi
commodit
commoditi
combi
combin
comba
combat
communit
community
communic
communica
communicat
communiti
communicati
communicatio
communication
combine
combines
communitie
communities
commoditie
commodities
cha
cu
cul
cult
cultu
cultur
cultura
cultural
con
cond
condi
condit
conditi
conditio
condition
conditions
cou
cour
coun
count
countr
cours
countri
countrie
countries
course
courses)
##ts)
##ats)
fats)
courses
pr
pro
prof
prod
produ
produc
product
prov
prog
progr
prop
proc
prob
progra
program
programm
proba
probab
prot
programs
programmi
programmin
programming
probabi
probabil
probabili
probabilit
probability
provi
provid
producti
productiv
productio
production
products
productivi
productivit
productivity
ph
phy
phys
physi
physic
physica
physical
propo
propos
proposi
proposit
propositi
propositio
proposition
propositions
proce
proces
proced
procedu
procedur
process
provide
procee
proceed
proceedi
proceedin
proceeding
proceedings
prope
proper
propert
property
procedure
procedures
##gh
##ugh
##ough
though
##rough
through
thought
thoughts
##igh
ligh
high
migh
might
##ight
light
lightw
lightwe
lightweight
##sight
insight
insights
##ng
chang
cog
cogn
ing
ingr
cogni
cognit
cogniti
cognitiv
eng
engi
engin
##ing
computing
##izing
processing
##ngu
##nging
##nizing
##onizing
##angu
langu
langua
languag
##anging
ranging
##ionizing
##tionizing
##utionizing
##lutionizing
##olutionizing
##volutionizing
##ang
##hang
##dang
##chang
exchang
##angl
##ndang
endang
##tangl
##ntangl
entangl
##ngt
##ngth
##king
##oking
cooking
##riz
##oriz
horiz
horizo
horizon
##tiz
##atiz
##ratiz
##cratiz
##ocratiz
##mocratiz
horizons
char
chara
charac
charact
chai
chain
##evolutionizing
revolutionizing
language
entangle
entanglem
entangleme
entanglemen
entanglement
change
compute
computer
ingre
ingred
ingredi
ingredie
ingredien
ingredient
ingredients
cognitive
##emocratiz
democratiz
democratize
engine
enginee
engineer
engineering
exchange
endange
endanger
endangere
endangered
##ength
##rength
##trength
strength
characte
character
##nology
##hnology
##chnology
##hology
##chology
##ychology
##sychology
psychology
##dology
##odology
##hodology
##mology
##thodology
##echnology
technology
##technology
##otechnology
##iotechnology
biotechnology
##ethodology
methodology
##emology
##temology
##stemology
##istemology
##pistemology
epistemology
##hing
##shing
##ching
##aching
##achings
##ishing
phishing
##lishing
##blishing
##ublishing
publishing
##eachings
teachings
##iology
biology
##rology
##orology
##eorology
##teorology
##eteorology
meteorology
au
aut
aud
auth
auto
autom
auton
autono
autonom
autonomo
autonomou
autonomous
aus
aust
austr
audi
austri
austria
austrian
automa
automo
automat
automot
automoti
automotiv
audie
audien
audienc
audience
automotive
automati
automatic
automatio
automation
automate
automated
ad
add
adv
addr
adm
adva
advan
advanc
admi
admin
admini
adminis
administ
administr
administra
administrat
administrato
administrator
administrators
ada
adap
adapt
ads
addre
addres
address
addresse
addresses
advance
advances
ag
nu
bu
buy
bud
budd
buddh
buddhi
buddhis
buddhism
sh
##ch
##ych
##ycho
##ychod
##ychody
##ychol
##ychodyn
##ycholo
##ycholog
##ychodyna
##ychodynam
##sycholog
psycholog
##sychodynam
psychodynam
psychologi
psychologic
psychologica
psychological
psychodynami
psychodynamic
##th
wh
anth
anthr
anthro
anthrop
anthropo
anthropol
anthropolo
anthropolog
eth
whi
whil
anthropologi
anthropologic
anthropologica
anthropological
while
##hy
##hyd
##ohyd
##bohyd
##rbohyd
##rbohydr
##arbohydr
carbohydr
carbohydra
carbohydrat
carbohydrate
carbohydrates
ethi
ethic
ethics
ethe
ether
ethere
ethereu
ethereum
anc
anci
ancie
ancien
ancient
ana
anal
analy
analys
analysi
analysis
##kch
##ckch
##ockch
##lockch
blockch
blockcha
blockchai
blockchain
exa
examp
exam
exampl
exami
examin
example
examine
examines
exc
excl
excla
exclai
exclaim
exci
excit
exclaime
exclaimed
excite
excitem
exciteme
excitemen
excitement
the
thing
things
thi
thr
thre
threa
threat
threate
threaten
threatens
this
thin
think
thinke
thinker
thinkers
##emp
temp
##mpl
##empo
##empor
##tempor
contempor
##ampl
sampl
contempora
contemporar
contemporary
tempe
temper
tempera
temperat
temperatu
temperatur
temperature
sample
samples
temperatures
##rch
arch
##arch
##earch
##search
##esearch
research
archi
archit
archa
archite
architec
architect
architectu
architectur
archae
archaeo
archaeol
archaeolo
archaeolog
archaeologi
archaeologic
archaeologica
archaeological
profe
profes
profess
professi
professio
profession
professiona
professional
profi
profil
profile
profiles
offe
offer
offi
offic
office
nut
nutr
nuc
nucl
nur
nurs
nutri
nurse
nurses
nucle
nuclea
nuclear
nutrit
nutriti
nutritio
nutrition
nutritiona
nutritional
nutrie
nutrien
nutrient
proto
protoc
protoco
protocol
protocols
prote
protec
protect
protei
protein
col
coll
cos
cosm
cost
costu
costum
cosmi
cosmic
cor
coo
coor
coord
coordi
coordin
coordina
coordinat
corr
cora
coral
corre
correc
correct
correcti
correctio
correction
correctiona
correctional
costume
costs
##ding
##nding
##unding
funding
##ndings
##indings
findings
##lding
##ading
##rading
trading
##ldings
##ildings
buildings
##ach
mach
each
sch
scho
schoo
school
schools
machi
machin
machine
machiner
machinery
##each
teach
reach
##reach
breach
teache
teacher
teachers
breache
breaches
##cha
##chan
##chani
##chanic
##chanis
##chanism
##chanisms
##echanisms
mechanisms
##echanic
mechanic
##chn
##chno
##chnol
##chnolo
##chnolog
##tch
##itch
kitch
##chnologi
kitche
kitchen
##echnologi
technologi
technologie
technologies
na
nat
natu
natur
nar
narr
narra
narrat
nas
nasa
nasa'
##s'
##rs'
nasa's
narrati
narrativ
nati
natio
nation
natura
natural
nature
##ers'
##mers'
##omers'
##tomers'
##stomers'
customers'
narrative
ne
new
neg
nego
neu
neur
neuro
negot
negoti
negotia
negotiat
negotiati
negotiatio
negotiation
negotiations
net
netw
netwo
networ
network
networks
nee
need
needs
neuron
neurons
neuros
neurosc
neurosci
neuroscie
neuroscien
neuroscient
neuroscienti
neuroscientis
neuroscientist
neuroscientists
no
nor
norm
norms
ni
nin
nine
##ow
show
pow
how
tow
dow
showc
showca
showcas
shows
aw
awa
awar
powe
power
showcase
towe
tower
towers
aware
awaren
awarene
awarenes
awareness
shu
shut
shutt
shutte
shutter
sha
shak
shap
shar
sho
shop
shops
she
share
shake
shakes
shakesp
shakespe
shakespea
shakespear
shakespeare
shape
##row
brow
##now
know
snow
##low
##llow
knowl
##ollow
follow
follows
knowle
knowled
knowledg
knowledge
brown
brows
browse
browser
browsers
tw
twi
twit
twitt
twitte
twitter
tr
to
tra
trad
tran
trans
transf
transp
transpo
transpor
transport
transporta
transportat
transa
transac
transact
transportati
transportatio
transportation
transacti
transactio
transaction
transfo
transfor
transform
trai
trac
track
train
training
transforme
transformer
transformers
transfe
transfer
transfers
"ha
"ham
"haml
"he
"hel
"hell
"hello
"hamle
"hamlet
importa
importan
important
imports
pha
phar
pharm
pharma
pharmac
pho
phon
phot
photo
photos
phe
phen
pheno
phenom
phenome
phenomen
phenomena
phone
phones
architectura
architectural
architecture
nationa
national
nations
##aliz
##iliz
##viliz
##viliza
##tiliz
utiliz
##vilizat
##ivilizat
civilizat
civilizati
civilizatio
civilization
civilizations
##naliz
##onaliz
##aliza
##alizat
##sonaliz
##rsonaliz
##ializat
##cializat
##cializati
##cializatio
##cialization
##cializations
utilize
##ersonaliz
personaliz
personalize
personalized
##ecializations
specializations
un
und
unc
uni
univ
unio
union
us
using
um
umb
umbr
ur
urb
urba
urban
unco
uncov
use
unde
under
unders
underst
understa
understan
understand
umbre
umbrel
umbrell
umbrella
unce
uncer
uncert
uncerta
uncertai
uncertain
uncertaint
uncertainty
uncove
uncover
unive
univer
univers
universa
universal
juda
judi
judic
judici
judicia
judicial
judai
judais
judaism
informa
informat
informati
informatio
information
mechanica
mechanical
mechanics
adapta
adaptat
adaptati
adaptatio
adaptation
adaptations
en
env
enf
enfo
enfor
enforc
envi
envir
enviro
environ
environm
ed
edu
educ
educa
educat
educati
educatio
education
edi
edit
editing
em
environme
environmen
environment
environmenta
environmental
environments
enforce
enforcem
enforceme
enforcemen
enforcement
educationa
educational
ec
eco
econ
econo
econom
economi
economic
ecol
ecolo
ecolog
ecos
ecosy
ecosys
ecosyst
ecologi
ecologic
ecologica
ecological
ecosyste
ecosystem
ecosystems
el
ey
es
eu
esp
eur
espr
euro
europ
ea
ear
earn
earning
earnings
ess
est
esta
estat
europe
europea
european
espre
espres
espress
espresso
ele
elec
elem
elect
electr
electri
electric
esse
essen
essent
essenti
essentia
essential
eye
eyew
eyewi
eyewit
eyewitn
eyewitne
eyewitnes
eyewitness
estate
eleme
elemen
element
elements
your
cur
curr
curre
curren
currenc
currency
agr
agri
agric
agricu
agricul
agricult
agricultu
agricultur
agricultura
agricultural
##ex
tex
text
##ox
box
fox
##ax
##lax
##alax
galax
galaxi
mex
mexi
mexic
mexica
mexican
##lex
complex
flex
flexi
flexib
flexibi
flexibil
flexibili
flexibilit
flexibility
galaxie
galaxies
compa
compar
compan
company
compani
compe
compet
compete
companie
companies
compara
comparat
comparati
comparativ
compari
comparis
compariso
comparison
comparisons
comparative
##tex
contex
context
##cex
##rex
brex
##acex
spacex
brexi
brexit
oce
occ
occu
occur
occurr
ocea
ocean
occurre
occurren
occurrenc
occurrence
interne
interna
internet
internat
internati
internatio
internation
internationa
international
expe
exper
expec
expect
expr
expo
expor
export
exports
experi
experim
expert
experti
expertis
expertise
experie
experien
experienc
experiencing
expecte
expected
expre
expres
express
expressi
expressio
expression
experime
experimen
experiment
experience
experiences
experimenta
experimental
experiments
colle
collec
collect
colli
collis
collisi
collisio
collision
collecti
collectio
collection
professionals
narratives
integrates
magazines
news
newsp
newspa
newspap
newspape
newspaper
newspapers
##pm
##opm
##lopm
##elopm
##velopm
##evelopm
developm
developme
developmen
development
##ming
##rming
##arming
farming
##oming
##coming
##aming
##ecoming
becoming
##eaming
##reaming
##treaming
streaming
tre
tri
tril
trill
tria
trial
trials
trilli
trillio
trillion
trillions
trea
tren
trend
treat
treatm
trends
treats
treatme
treatmen
treatment
treatments
observations
collections
contexts
cus
cust
custo
custom
cui
cuis
cuisi
cuisin
cuisine
cuisines
custome
customer
informs
ena
enab
enabl
enable
enc
encr
encry
encryp
enco
encod
encrypt
encrypti
encryptio
encryption
encode
encoder
ent
ens
ensu
ensur
entr
ensure
entre
entrep
entrepr
entrepre
entrepren
entreprene
entrepreneu
entrepreneur
entrepreneurs
entrepreneursh
entrepreneurshi
entrepreneurship
ente
enter
entert
enterta
entertai
entertain
entertainm
entertainme
entertainmen
entertainment
ensures
##eh
veh
beh
reh
##reh
##reho
##rehou
beha
behav
reha
rehab
##arehou
warehou
##sh
warehous
warehousing
vehi
vehic
vehicl
behavi
behavio
behavior
rehabi
rehabil
rehabili
rehabilit
rehabilita
rehabilitat
rehabilitati
rehabilitatio
rehabilitation
vehicle
vehicles
##shi
##ship
##nship
##shio
##shion
##onship
##ashion
fashion
##onships
##ish
##lish
##blish
##ublish
publish
##ionships
##tionships
##ationships
##lationships
publishe
published
##elationships
relationships
evo
evol
evolu
evolut
evoluti
evolutio
evolution
eve
even
ever
every
event
evi
evid
events
evide
eviden
evidenc
evidence
autho
author
authors
authe
authen
authent
authenti
authentic
authentica
authenticat
authenticati
authenticatio
authentication
explore
explora
explorat
explorati
exploratio
exploration
explores
processe
processes
pharmace
pharmaceu
pharmaceut
pharmaci
pharmacis
pharmacist
pharmacists
pharmaceuti
pharmaceutic
pharmaceutica
pharmaceutical
interve
interven
intervent
interventi
interventio
intervention
intervi
intervie
interview
interviews
interventions
##yw
##lyw
##llyw
##ollyw
hollyw
hollywo
hollywoo
hollywood
##wa
##wab
##wabl
##war
##wal
##wall
##walls
##lwar
##twar
##ftwar
##oftwar
softwar
##alwar
malwar
##ewabl
##newabl
##enewabl
renewabl
renewable
software
malware
##ewalls
##rewalls
##irewalls
firewalls
fo
for
form
forg
forma
format
formati
formatio
formation
foo
food
foot
footb
footba
footbal
football
fos
foss
fossi
fossil
forge
forget
va
val
valu
var
vari
vario
variou
various
vali
valid
valida
validat
validate
value
valua
valuat
valuati
valuatio
valuation
values
##ud
##udy
##tudy
study
##tud
stud
##oud
##loud
cloud
studi
stude
studen
student
studie
studio
studies
studios
students
vu
vul
vuln
vulne
vulner
vulnera
vulnerab
vulnerabi
vulnerabil
vulnerabili
vulnerabilit
vulnerability
vi
vid
vo
vis
vol
vola
volat
visi
volati
volatil
volatili
volatilit
volatility
voi
voic
visio
vision
visit
vide
video
visite
visited
voice
ve
vet
vete
veter
veteri
veterin
veterina
veterinar
veterinary
videos
ca
cap
cab
cabl
cy
cyb
cyc
cycl
cable
cables
cybe
cyber
cybers
cyberse
cybersec
cybersecu
cybersecur
cybersecuri
cybersecurit
cybersecurity
cycle
cycles
cr
cry
cryp
crypt
crypto
cryptoc
cryptocu
cryptocur
cryptocurr
cl
cli
clim
clima
climat
clin
clini
clinic
climate
clie
clien
client
clients
cryptocurre
cryptocurren
cryptocurrenc
cryptocurrency
car
carb
card
carbo
carbon
cardi
cardio
cardiov
cardiova
cardiovas
cardiovasc
cardiovascu
cardiovascul
cardiovascula
cardiovascular
cam
came
camer
camera
cameras
cau
caus
cal
calc
calcu
calcul
calculu
call
calculus
calls
cause
caused
capt
captu
captur
caps
capture
clinica
clinical
clinics
can
cat
cata
catal
cataly
cas
catalys
catalyst
case
cases
cars
care
##op
exop
crop
pop
popu
##oping
popul
##loping
exopl
##vop
popula
exopla
exoplan
##vops
popular
populat
##lop
##opl
##cop
##scop
populati
populatio
population
##elop
##velop
##evelop
develop
##eloping
##veloping
##eveloping
developing
##evops
devops
exoplane
exoplanet
exoplanets
##escop
##lescop
##elescop
telescop
telescope
telescopes
##eopl
peopl
people
ext
extr
##up
sup
##rup
##rupt
##tup
##rtup
##artup
##tartup
startup
##srupt
startups
##isrupt
disrupt
supe
super
superp
superpo
superpos
superposi
superposit
superpositi
superpositio
superposition
##py
##apy
##rapy
therapy
extra
extrac
extract
extre
extrem
extreme
develops
pl
pla
play
plays
plat
platf
platfo
platfor
platform
plan
platforms
plann
planning
plate
py
pyth
pytho
python
##pl
##ipl
##cipl
##ncipl
##tipl
##ltipl
##ultipl
multipl
multipla
multiplay
##scipl
##incipl
principl
##pli
##plic
##plica
##plicat
##plicati
##plicatio
##plication
##iscipl
discipl
discipli
disciplin
principle
principles
multiplaye
multiplayer
##eplication
replication
discipline
disciplines
ap
ape
aper
apert
apertu
apertur
aperture
plans
plane
planes
pa
pap
po
pol
pape
paper
pos
pot
pote
poten
potent
potenti
potentia
potential
pe
pt
per
perf
perfo
perfor
perform
performa
performan
performanc
pers
persp
perso
person
persona
personal
pts
ptsd
perspe
perspec
perspect
perspecti
perspectiv
perspective
perspectives
performance
pat
par
park
pan
pand
panda
part
pandas
parks
patt
pati
parti
partic
particl
partici
particip
participa
participan
participant
patte
patter
pattern
patterns
patie
patien
patient
patients
pane
panel
panels
particle
post
posts
pose
##pr
##epr
repr
depr
##spr
##ispr
crispr
repro
reprod
reprodu
reproduc
reproduci
reproducib
reproducibi
reproducibil
reproducibili
reproducibilit
reproducibility
repre
repres
represe
represen
represent
representa
representat
representati
representatio
representation
representations
depre
depres
depress
depressi
depressio
depression
performances
poli
polic
policy
polit
poll
pollu
pollut
pola
polar
polluti
pollutio
pollution
politi
politic
politica
political
##ur
##uring
tour
tur
turb
##turing
##cturing
##curing
##acturing
##facturing
##ufacturing
##nufacturing
##anufacturing
manufacturing
turbi
turbin
tourn
tourna
tournam
touri
touris
tourism
tourname
tournamen
tournament
tournaments
turbine
turbines
##ecuring
securing
##bu
##but
##rbu
##rbuc
##rbuck
##arbuck
##tarbuck
starbuck
starbucks
##ibut
##ribut
##tribut
##stribut
##istribut
distribut
distributi
distributio
distribution
fu
fun
fund
func
funct
funda
fundam
functi
functio
function
functions
fue
fuel
fuels
fundame
fundamen
fundament
fundamenta
fundamental
ling
lingu
lingui
linguis
linguist
linguisti
linguistic
fr
fro
from
fra
fram
fran
franc
france
frame
framew
framewo
framewor
framework
frameworks
fa
fam
fab
fabr
fac
famo
famou
famous
fami
famil
famili
fabri
fabric
fan
fans
fai
fail
failur
failure
familie
families
##ry
##ory
##mory
##tory
##emory
memory
##ty
##fy
##ify
##cify
##ly
##ecify
specify
##ity
electricity
##urity
sty
styl
##vity
##curity
##lity
##ivity
##tivity
##ctivity
##ativity
##ecurity
security
style
styles
##ectivity
##nectivity
connectivity
##ety
##fety
##afety
safety
##eativity
creativity
##sity
##nity
##anity
##rsity
##nsity
##ianity
##tianity
##stianity
##istianity
##ristianity
christianity
##ersity
##versity
##iversity
##diversity
##odiversity
##iodiversity
biodiversity
##ensity
density
sur
surv
surg
surgi
surgic
surgica
surgical
surve
survei
surveil
surveill
surveilla
surveillan
surveillanc
surveillance
##cy
##cyc
##cycl
##ncy
##rcycl
##orcycl
##torcycl
##otorcycl
motorcycl
##icycl
bicycl
bicycle
bicycles
motorcycle
motorcycles
##ency
##gency
##rgency
##ergency
emergency
##atory
##ratory
##latory
##ulatory
##gulatory
##oratory
##boratory
##aboratory
laboratory
##story
##istory
history
##egulatory
regulatory
##yo
##yon
##yond
##eyond
beyond
##ay
lay
##ray
##tray
##traya
##trayal
##ny
##yn
##any
##many
##rmany
##ermany
germany
##etrayal
betrayal
laye
layer
layers
##eyn
keyn
ki
kil
kilo
kilom
kilome
kilomet
kilomete
kilometer
kilometers
keyne
keynes
keynesi
keynesia
keynesian
emo
emot
emoti
emotio
emotion
emotiona
emotional
ema
emi
emis
emiss
emissi
emissio
emission
emissions
emai
email
##ility
##bility
##ability
##ality
##uality
duality
##tality
##nability
##inability
##ainability
##tainability
##stainability
##ustainability
sustainability
##iability
##liability
##itality
##pitality
##spitality
##ospitality
hospitality
##eliability
reliability
##if
##dif
##odif
modif
modifi
modific
modifica
modificat
modificati
modificatio
modification
##idif
##cidif
acidif
acidifi
acidific
acidifica
acidificat
acidificati
acidificatio
acidification
lif
##fu
##fug
##efug
refug
refuge
refuges
life
##tif
##rtif
artif
##ntif
##ntifi
##ntific
##lif
##dlif
##ldlif
##nif
##gnif
##rif
drif
drift
##ignif
signif
signifi
signific
significa
significan
significanc
significant
##ildlif
wildlif
wildlife
##entific
##ientific
##cientific
scientific
significance
artifa
artifac
artifact
artifacts
artifi
artific
artifici
artificia
artificial
fi
fib
fl
flu
fluc
fluct
fluctu
fluctua
fluctuat
fe
fea
feat
featur
feature
fibe
fiber
fin
fina
finan
financ
financing
financi
financia
financial
fil
film
fit
fitn
fis
fisc
fisca
fiscal
fitne
fitnes
fitness
##ning
##rning
##aning
##arning
##orning
morning
##ting
##ving
##ling
##cing
##ncing
##sing
##using
##ousing
housing
##iving
##riving
driving
##earning
learning
##eaning
meaning
##encing
##tencing
##ntencing
##entencing
sentencing
##eling
##deling
##odeling
modeling
##cting
acting
##ecting
##recting
##irecting
directing
##du
##duc
##ndu
##indu
hindu
hindui
hinduis
hinduism
##educ
reduc
reduce
##um
##cum
##ocum
docum
##sum
consum
docume
documen
document
consume
consumer
documenta
documentat
documents
documentati
documentatio
documentation
##rk
##ark
mark
##mark
##ork
work
##omark
##iomark
biomark
marke
market
biomarke
biomarker
biomarkers
markets
works
worko
workou
workout
spa
spac
span
spans
spai
spain
space
##ary
evolutionary
##mary
##rary
##imary
primary
##erary
##terary
##iterary
literary
##ery
##very
##try
##tery
##ttery
##attery
battery
##overy
##covery
##scovery
##ivery
##livery
##iscovery
discovery
##etry
##metry
##ometry
##eometry
geometry
##elivery
delivery
them
thema
themat
themati
thematic
theme
themes
spe
spo
spor
spec
sport
sports
speci
spee
speed
speeds
specie
species
##al
behavioral
electrical
##bal
##bally
##obally
##lobally
globally
##ball
##obal
##lobal
global
developmental
onl
onli
onlin
##ll
##llu
##llul
##llula
##llular
all
allo
alloc
alloca
allocat
allocati
allocatio
allocation
##lli
##llio
##llion
##llit
##illion
billion
million
al
alg
alt
algo
algor
algori
algorith
algorithm
algorithms
##lf
##lfa
##lfar
billions
##alth
bal
bala
balan
balanc
##fal
##fall
##rfall
alge
algeb
algebr
algebra
##bl
##abl
##nabl
##sabl
##usabl
##inabl
##ainabl
##tainabl
##stainabl
##ustainabl
sustainabl
##mb
##emb
memb
membe
member
##ealth
health
online
##eusabl
reusabl
reusable
##ellular
cellular
sustainable
balance
##ellit
##tellit
##atellit
satellit
satellite
##erfall
##terfall
##aterfall
waterfall
alte
alter
altern
alterna
alternat
alternati
alternativ
alternative
alternatives
##elfar
welfar
welfare
millions
##cal
##ical
scal
##ocal
local
##mical
##ural
##tural
##ctural
##uctural
##ructural
##tructural
structural
##gical
##ogical
##logical
##ological
##rical
##orical
##torical
##trical
##atrical
theatrical
##tical
##dical
##storical
##istorical
historical
ha
hab
hav
ho
hou
hol
habi
habit
habita
habitat
has
hous
have
##edical
medical
scale
scales
##eological
geological
house
houses
hole
holes
gu
gui
guid
guide
guidel
guideli
guidelin
guideline
guidelines
##ual
##nual
##anual
manual
##tual
##itual
ritual
rituals
ci
civ
cit
citi
civi
civil
citie
cities
ce
cen
cens
censu
census
ht
htt
http
hi
his
##tball
##etball
##ketball
##sketball
##asketball
basketball
##eball
##seball
##aseball
baseball
hot
hos
hosp
hospi
hospit
hospital
hospitals
##po
##pon
##spon
##spons
##pos
##posi
##posit
##posits
##espons
respons
response
responses
##eposits
deposits
hote
hotel
hotels
##ul
##cul
##cula
##cular
##ecular
##lecular
##olecular
molecular
##ou
rou
##thou
rout
##thout
routi
routin
##ithout
without
sou
soun
sound
##ug
##ugg
sugg
##rug
drug
##ous
##ously
##rously
##cou
##ccou
accou
##orously
##gorously
accoun
account
##igorously
rigorously
##ious
##gious
##cious
##ciousn
##igious
##ligious
##sciousn
consciousn
accounts
##lu
##olu
solu
solut
soluti
solutio
solution
solutions
sugge
sugges
suggest
routine
routines
consciousne
consciousnes
consciousness
##eligious
religious
##gu
##agu
##eagu
leagu
league
leagues
ru
run
##mu
##mmu
##ommu
##commu
##commun
##communi
##communic
##communica
##communicat
##communicati
##communicatio
##communication
##communications
##ecommunications
##lecommunications
##elecommunications
telecommunications
##omical
##nomical
##onomical
##ronomical
##tronomical
##stronomical
astronomical
##emical
chemical
chi
chin
chine
chines
chinese
du
due
##nu
##onu
##ronu
##cronu
##cronut
##cronutr
##cronutri
##ru
##ruc
##truc
struc
##truct
struct
structur
##struct
instruct
instructi
instructio
instruction
instructional
##acronutri
macronutri
##icronutri
micronutri
##cu
##scu
##scus
##scuss
##iscuss
discuss
##ua
##uar
##tuar
##ctuar
##nctuar
##anctuar
sanctuar
##su
##ssu
sanctuari
##issu
tissu
discusse
discusses
##enu
##venu
##evenu
revenu
revenue
sanctuarie
sanctuaries
structure
structures
macronutrie
macronutrien
macronutrient
macronutrients
micronutrie
micronutrien
micronutrient
micronutrients
tissue
##urc
##ourc
sourc
##sourc
source
sources
##esourc
resourc
resource
##ba
##bag
##rbag
##rbags
##irbags
airbags
##bo
##bol
##abol
##tabol
##obo
robo
##boo
##book
robot
roboti
robotic
robotics
##taboli
##tabolis
##tabolism
##aba
##bat
##taba
##ataba
databa
databas
##ebook
facebook
##etabolism
metabolism
##ebat
debat
debate
database
databases
ac
acc
acr
acro
act
acros
across
acti
activ
actio
action
activi
activit
activiti
activitie
activities
acco
accom
accomm
accommo
accommod
accommoda
accommodat
accommodate
am
ame
amer
amen
ameri
americ
america
american
americano
ameni
amenit
ameniti
amenitie
amenities
healthc
healthca
healthcar
healthcare
##fo
##for
##nfor
##infor
##ainfor
rainfor
rainfore
rainfores
rainforest
##efor
defor
defore
defores
deforest
deforesta
deforestat
deforestati
deforestatio
deforestation
##aly
##taly
italy
io
iot
ios
is
isl
isla
islam
ic
it
ital
iso
itali
italia
italian
ice
ma
math
mar
mari
marin
mars
mathe
mathem
mathema
mathematical
mathemat
mathemati
mathematic
mathematics
marine
man
mana
manag
manage
managem
manageme
managemen
management
##ap
##rap
therap
therapi
therapis
therapist
therapists
##pe
##pen
##pend
##pes
##pends
##ipes
##cipes
##ecipes
recipes
##epends
depends
##aw
law
raw
##tw
##wr
##nwr
##nwri
##nwriting
##etw
betw
betwe
betwee
between
##enwriting
##eenwriting
##reenwriting
##creenwriting
screenwriting
##ew
##iew
##view
##eview
review
##ating
dating
##tting
##ttings
##sting
##ettings
settings
##esting
testing
##ctical
##actical
practical
##stical
##istical
##tistical
##atistical
##tatistical
statistical
##etical
##retical
##oretical
theoretical
##rv
##erv
serv
##serv
conserv
conserva
conservat
conservati
conservatio
conservation
##eserv
preserv
reserv
preserve
reserve
reserves
cont
conta
contr
contro
control
contai
contain
contains
conti
contin
conn
conc
cons
consi
consid
conside
consider
considera
considerat
considerati
consideratio
consideration
conce
concer
concern
concerns
conne
connec
connect
contine
continen
continent
continental
ar
ath
athl
athle
athlet
athlete
athletes
at
av
avo
att
ato
atom
atomi
atomic
avoi
avoid
avoida
avoidan
avoidanc
avoidance
attr
attra
attrac
attract
atta
attac
attack
attacks
atte
atten
attent
attenti
attentio
attention
mat
mai
main
maint
mainta
maintai
maintain
mate
mater
materi
material
materials
mainte
mainten
maintena
maintenan
maintenanc
maintenance
##mal
##rmal
##imal
animal
##ermal
##thermal
##othermal
##eothermal
geothermal
but
bur
bus
buri
burial
fact
facto
factor
factors
faci
facil
facili
facilit
facilita
facilitat
faciliti
facilitate
facilitates
face
facilitie
facilities
##tho
##thod
##thods
##thodo
##thodol
##thodolo
##thodolog
##thodologi
##ethods
methods
mo
mob
mod
mov
mor
moo
mooc
mot
moocs
mobi
mobil
moti
motiv
motiva
motivat
motivati
motivatio
motivation
mort
mortg
mortga
mortgag
##br
##bra
##brar
##ibrar
librar
librari
more
mobile
librarie
libraries
mode
moder
modern
modes
moderni
modernis
modernist
##ethodologi
methodologi
methodologie
methodologies
move
movem
moveme
movemen
movement
movements
mortgage
##on
##onal
so
sol
soc
sola
solar
##ov
gov
lov
rov
##nov
innov
##cov
innova
innovat
##scov
innovati
innovation
soi
soil
##iscov
discov
##om
dom
##omm
##onom
##rom
"rom
##comm
##conom
doma
bo
boo
both
book
go
goth
goal
##og
log
dog
##or
##orl
worl
world
##lor
##ol
tool
theor
##ord
##cord
##tor
stor
##ctor
##octor
doctor
stora
storag
bl
bla
blac
black
ro
roc
rock
tol
books
tools
##ctors
doctors
##sor
##nsor
##nsors
##cords
##lors
goals
domai
domain
##gn
##ign
gothi
gothic
##ilors
##ailors
tailors
theori
logi
logic
logis
logist
logisti
logistic
logistics
##conomi
##conomic
##ion
bon
bond
disruption
fluctuation
coordination
##ton
##cton
##tion
##ctoni
##ctonic
##ation
##dation
##ction
##ndation
##adation
##radation
##gradation
##action
##faction
##ntion
##sion
disruptions
bonds
##ctonics
##actions
##tions
##sfaction
##isfaction
##tisfaction
##atisfaction
satisfaction
fluctuations
##cation
##ocation
location
##ication
##dication
##dications
soci
social
socio
socc
##gal
##sign
##urn
##turn
##aturn
saturn
##turns
##do
##ado
##nado
##rnado
tornado
##ro
wro
wrot
andro
##oc
##ock
##co
##tock
stock
androi
android
##coi
##coin
##stock
##tcoin
##itcoin
bitcoin
##ration
##gration
##igration
migration
competen
competenc
competenci
##ional
##tional
##ctional
##itional
traditional
##sonal
##asonal
##ision
##cision
##ssion
##ission
mission
missions
##tal
##ital
##gital
##ntal
##igital
digital
##ag
##tag
stag
##tagr
##tagra
##tagram
##stagram
instagram
##sag
##ssag
##gi
##rg
##arg
larg
li
lik
lim
liv
lin
link
limi
limit
limitation
links
limitations
##ic
quic
quick
servic
effic
effici
##cur
##dic
##tic
pric
##vic
##nc
sc
##ctic
##actic
practic
sci
##dici
##dicin
##dict
##ith
with
##ath
##iv
priv
priva
privat
##ily
##aily
daily
busi
busin
cri
critic
crim
crimi
crimin
criminal
agi
agil
##iction
##diction
##itions
traditions
acci
accid
hypothesi
##ill
##kill
skill
exi
characteri
##ci
##cid
##cidiv
##cidivi
##rci
div
##tiv
##riv
##riva
##rivativ
##ntiv
##itiv
##ca
##cad
##cr
##cri
##crib
##ct
##li
##il
##mil
##imil
simil
##ail
##tail
simila
similar
similari
similarit
similariti
##nd
##and
##mand
##anda
##andar
##andard
##tandard
standard
##ind
wind
##id
bid
##ticid
bidi
bidir
##rid
grid
##di
##dia
ti
tim
##in
##ink
##rink
drink
min
##ain
##min
##main
##rmin
##rain
brain
rain
##train
powertrain
ai
##ali
humani
##am
gam
dam
sm
sma
smar
smart
ba
bi
bia
##ak
tak
##rak
brak
##at
##ata
data
rat
lat
latt
##ati
##tati
stati
##rat
theat
##trat
strat
##anc
##ranc
##aur
##aura
##auran
##tauran
##taurant
##ad
wa
war
warm
##ma
##man
##mantic
##av
##nm
##rnm
pet
##nt
##ant
##tant
##na
##nai
dna
##nti
##an
##ar
##arn
##tar
star
art
##it
sit
##itt
##ritt
writt
ri
##ti
di
##ni
##nni
thei
their
##ri
##ral
user
##tt
st
str
##cas
##cast
##dicts
##sit
##bsit
was
users
drinks
bas
##ntis
##ntist
##ntists
##as
##asur
##mains
statis
statistic
statistics
standards
##nnis
dams
bias
##sth
##nais
##naiss
##naissanc
##alis
##alistic
##cis
##sticid
pesticid
ris
risk
##scrib
dis
distant
##cidivis
##cidivism
stars
##rcis
##cts
##dictions
##sitiv
##nsitiv
powertrains
critics
##staurant
##staurants
hypothesis
humanis
humanistic
skills
pets
##stions
exis
exist
characteris
characteristic
characteristics
dn
dns
##nr
risks
##rt
as
ass
##ts
##ls
connects
modifications
innovations
habitats
##fs
features
considerations
##cisions
uses
##rs
dr
languages
distributions
trains
reduces
computers
formations
##st
productions
##nts
datas
enables
se
sectors
sensors
semantic
secur
sensitiv
seasonal
set
sel
sent
sente
sentenc
sentence
le
leav
learn
lean
legal
lett
lev
lette
letter
we
weath
websit
web
be
bert
bett
beli
bidire
bidirectional
like
weathe
weather
##ecast
forecast
pre
predicts
precis
precision
predictions
