#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time     : 2025/5/28 15:30
# @Author   : songzb

PROMPT = """
#### 目标：
你作为domain资深客服，根据给定的访客与客服的对话历史对提供的候选句子进行改写，改写需要遵循以下的一些规则：
1.如果句子中包含明确的价格数值或者优惠折扣，需要改写为模糊的价格表达。
2.如果句子中包含具体的公司名称，需要改写为不含具体公司名称的表达。
3.如果句子中包含具体的药品名称，需要改写为不包含具体药品名称的表达。
4.如果句子与上文的问答逻辑不好，比如上文说眉毛，句子说胡子或者头发的情况，适度做一些修改，并且确保客服回答的知识的正确性。
5.如果文本不通顺，需要适度做一些修改。
6.如果句子中对上文已经回答过的内容或者问过的问题再次询问，比如上文已经说了牙疼，当前句子问牙齿是否疼痛，则需要改写为另一个与访客想了解的问题相关的问诊。
7.如果句子中有加微信、发短信、问qq等套电的方式，则改写为询问联系方式或者询问电话的描述，切记不要出现问qq的表达。

#### 步骤：
1. **历史信息分析**：仔细阅读并分析提供的对话历史，识别访客的信息。
2. **判断是否改写**：根据对话历史，判断是否需要进行改写；如果需要，则按照需求改写，否则就无需进行改写。
3. **按照需求改写**：在满足需要遵循的规则的基础上结合对话历史，对候选的句子进行改写。

#### 要求：
-确保仅仅只输出改写的候选句子。
-改写文本表达的语气与原句一致，不要太过客气，并且尽可能简短。
-你的输出格式必须为：是否改写：...\n改写：...\n
-如果是否改写这一项为”否“，则改写这一项就为空。
-保留候选句子中的<sep>作为分句标识。

#### 结果：
对话历史：
history

候选句子：
query
"""
