Repository: pypi-data/pypi-mirror-372
Catalog: packages/geovisio/geovisio-2.10.0.tar.gz/geovisio-2.10.0/geovisio/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Simple 360° geolocated pictures hosting
es: Alojamiento sencillo para imágenes 360° geolocalizadas

source: Full page version
es: Versión de página completa

source: Viewer
es: Visor

source: Embed pre-configured viewer
es: Incrustar visor pre-configurado

source: Easiest way to have a working GeoVisio viewer on your website
es: La forma más fácil de incluir un visor GeoVisio en tu página web

source: Use JS library
es: Usar biblioteca JS

source: A completely configurable viewer for your website
es: Un visor completamente configurable para tu página web

source: Links
es: Enlaces

source: Pictures viewer
es: Visor de imágenes

source: API docs
es: Documentación de la API

source: JS library docs
es: Documentación de la biblioteca JS

source: Repositories
es: Repositorios

source: You need to enable JavaScript to run this app.
es: Debes activar JavaScript para poder ver esta aplicación.

source: Authentication is mandatory
es: Es obligatorio autenticarse

source: Only Bearer token are supported
es: Sólo se admite token Bearer

source: Invalid '%(format)s' format for image, only the following formats are available: %(allowed_formats)s
es: Formato '%(format)s' inválido para la imagen, solo están disponibles los siguientes formatos: %(allowed_formats)s

source: Picture can't be found, you may check its ID
es: No se encuentra la imagen, puedes comprobar su ID

source: Picture is not available (either hidden by admin or processing)
es: La imagen no está disponible (ocultada por un administrador, o todavía está procesándose)

source: HD Picture file is not available
es: El fichero imagen de alta calidad no está disponible

source: Picture derivates file are not available
es: Ficheros de imágenes derivadas no disponibles

source: Unable to read picture on filesystem
es: Imposible leer el fichero desde el sistema de ficheros

source: Sort by file date is not possible on this sequence (no file date information available on pictures)
es: No se puede ordenar por fecha de fichero en esta secuencia (las imágenes no tienen información de fecha)

source: Sort using %(sort)s is not possible on this sequence, picture %(pic)s is missing mandatory metadata
es: No se puede ordenar por %(sort)s en esta secuencia, la imagen %(pic)s no contiene los metadatos necesarios

source: JWT token signature does not match
es: La firma del JWT no coincide

source: Token does not exist anymore
es: El token ya no existe

source: Token not yet claimed, this token cannot be used yet. Either claim this token or generate a new one
es: El token no ha sido reclamado aún, no puede utilizarse. Reclama el token, o bien genera uno nuevo

source: Unsupported filter parameter
es: Parámetro de filtro no admitido

source: Impossible to finish authentication flow
es: No se pudo completar el proceso de autenticación

source: You can try to clear your cookies and retry. If the problem persists, contact your instance administrator.
es: Puedes probar a borrar las cookies y reintentar. Si el problema persiste, ponte en contacto con el administrador de la instancia.

source: There is no collection created after %(d)s
es: No hay colecciones creadas después del %(d)s

source: There is no collection created before %(d)s
es: No hay colecciones creadas antes del %(d)s

source: Collection doesn't exist
es: La colección no existe

source: Impossible to find a thumbnail for the collection
es: No se encuentra vista previa de la colección

source: Picture visibility parameter (visible) should be either unset, true or false
es: El parámetro de visibilidad de la imagen (visible) debe ser true, false, o no definirse

source: Sequence title is not valid, should be a string with a max of 250 characters
es: El título de la secuencia no es válido, debería ser una cadena de 250 caracteres como máximo

source: Sort order parameter is invalid
es: El parámetro de ordenación no es válido

source: Relative heading is not valid, should be an integer in degrees from -180 to 180
es: La orientación relativa no es válida, debería ser un número entero en grados entre -180 y 180

source: You're not authorized to edit this sequence
es: No tienes autorización para modificar esta secuencia

source: Sequence %(c)s is in %(s)s state, its visibility can't be changed for now
es: La secuencia %(c)s está en estado %(s)s, su visibilidad no puede modificarse por el momento

source: Collection %(c)s wasn't found in database
es: La colección %(c)s no se encontró en la base de datos

source: Impossible to find user %(u)s
es: No se encuentra el usuario %(u)s

source: No data loaded for user %(u)s
es: No se pudieron cargar datos del usuario %(u)s

source: No matching sequences found
es: No se encuentran secuencias correspondientes

source: limit parameter should be an integer between 1 and 10000
es: el parámetro de límite debe ser un número entero entre 1 y 10000

source: limit parameter should be a valid, positive integer (between 1 and 10000)
es: el parámetro debe ser un número entero, positivo y válido (entre 1 y 10000)

source: `startAfterRank` and `withPicture` are mutually exclusive parameters
es: `startAfterRank` y `withPicture` son mutuamente excluyentes

source: startAfterRank parameter should be a positive integer (starting from 1)
es: El parámetro startAfterRank debe ser un número entero (empezando por 1)

source: startAfterRank parameter should be a valid, positive integer
es: El parámetro startAfterRank debe ser un número entero positivo

source: No more items in this collection (last available rank is %(r)s)
es: No hay más elementos en esta colección (el último índice es %(r)s)

source: Item doesn't exist
es: El elemento no existe

source: Search using POST method should have a JSON body
es: La búsqueda con método POST debe incluir un cuerpo en formato JSON

source: Parameter limit must be either empty or a number between 1 and 10000
es: El parámetro limit debe estar vacío, o bien ser un número entero entre 1 y 10000

source: Parameter place_fov_tolerance must be either empty or a number between 2 and 180
es: El parámetro place_fov_tolerance debe estar vacío o ser un número entre 2 y 180

source: Parameter intersects should contain a valid GeoJSON Geometry (not a Feature)
es: El parámetro intersects debe contener una entrada Geometry GeoJSON válida (no una Feature)

source: Parameter ids should be a JSON array of strings
es: El parámetro ids debe ser una lista JSON de cadenas

source: Parameter collections should be a JSON array of strings
es: El parámetro collections debe ser una lista JSON de cadenas

source: Picture doesn't exist
es: La imagen no existe

source: Content type should be multipart/form-data
es: El Content-Type debe ser multipart/form-data

source: Missing "position" parameter
es: Falta el parámetro "position"

source: Position in sequence should be a positive integer
es: La posición en secuencia debe ser un número entero positivo

source: Longitude cannot be overridden alone, override_latitude also needs to be set
es: La longitud no se puede forzar sola, hay que forzar la latitud también con override_latitude

source: Latitude cannot be overridden alone, override_longitude also needs to be set
es: La latitud no se puede forzar sola, hay que forzar la longitud también con override_longitude

source: For parameter `override_longitude`, `%(v)s` is not a valid longitude
es: Para el parámetro `override_longitude`, `%(v)s` no es una longitud válida

source: For parameter `override_latitude`, `%(v)s` is not a valid latitude
es: Para el parámetro `override_latitude`, `%(v)s` no es una latitud válida

source: Picture blur status should be either unset, true or false
es: El estado de difuminado de la imagen debe ser true, false, o no estar definido

source: No picture file was sent
es: No se envió ningún fichero de imagen

source: Picture file is either missing or in an unsupported format (should be jpg)
es: El fichero de imagen falta o está en un formato no admitido (debe ser jpg)

source: Picture at given position already exist
es: Ya existe una imagen en la posición dada

source: Impossible to parse picture metadata
es: No se pueden leer los metadatos de la imagen

source: Picture wasn't correctly saved in filesystem
es: La imagen no se guardó correctamente en el sistema de ficheros

source: Heading is not valid, should be an integer in degrees from 0° to 360°. North is 0°, East = 90°, South = 180° and West = 270°.
es: La orientación no es válida, debería ser un número entero en grados, de 0° to 360°. El norte es 0°, este = 90°, sur = 180° y oeste = 270°.

source: Picture %(p)s wasn't found in database
es: La imagen %(p)s no se encuentra en la base de datos

source: You're not authorized to edit this picture
es: No estás autorizado a modificar esta imagen

source: Picture %(p)s is in %(s)s state, its visibility can't be changed for now
es: La imagen %(p)s está en estado %(s)s, su visibilidad no puede modificarse por ahora

source: One of required parameter is empty
es: Está vacío uno de los parámetros obligatorios

source: Tile format is invalid, should be either pbf or mvt
es: El formato de mosaico de teselas no es válido, debe ser pbf o mvt

source: X or Y parameter is out of bounds
es: X o Y están fuera de rango

source: Z parameter is out of bounds (should be 0-15)
es: El parámetro Z está fuera de rango (debe estar entre 0 y 15)

source: Impossible to get tile
es: Imposible recuperar la tesela

source: Parameter datetime should contain one or two dates
es: El parámetro datetime debe contener una o dos fechas

source: Parameter bbox must contain valid longitude (-180 to 180) and latitude (-90 to 90) values
es: El parámetro bbox debe contener valores válidos de longitud (entre -180 y 180) y latitud (entre -90 y 90)

source: Parameter bbox must be in format [minX, minY, maxX, maxY]
es: El parámetro bbox debe seguir el formato [mínX, mínY, máxX, máxY]

source: Parameter %(p)s must be coordinates in lat,lon format
es: El parámetro %(p)s debe seguir el formato de coordenadas lat,lon

source: Longitude in parameter %(p)s is not valid (should be between -180 and 180)
es: La longitud en el parámetro %(p)s no es válida (debe estar entre -180 y 180)

source: Latitude in parameter %(p)s is not valid (should be between -90 and 90)
es: La latitud en el parámetro %(p)s no es válida (debe estar entre -90 y 90)

source: Parameter %(p)s is invalid (should be a distance range in meters like "5-15")
es: El parámetro %(p)s no es válido (debería ser un rango de distancias en metros, como «5-15»)

source: Parameter %(p)s has a min value greater than its max value
es: El parámetro %(p)s tiene un valor mínimo más grande que su valor máximo

source: Parameter %(p)s must be a valid list
es: El parámetro %(p)s debe ser una lista válida

source: Unsupported sortby parameter: invalid column name
es: Nombre de columna inválido para el parámetro sortby

source: Unsupported sortby parameter: syntax isn't correct
es: Parámetro sortby inválido: la sintaxis no es correcta

source: limit parameter should be a valid, positive integer (between 1 and %(v)s)
es: El parámetro limit debe ser un número entero y positivo (entre 1 y %(v)s)

source: limit parameter should be an integer between 1 and %(v)s
es: El parámetro limit debe ser un número entero entre 1 y %(v)s

source: longitude needs to be between -180 and 180
es: La longitud ha de estar entre -180 y 180

source: latitude needs to be between -90 and 90
es: La latitud ha de estar entre -90 y 90

source: Tiles are not available for flat pictures
es: No hay teselas para las imágenes planas

source: Column parameter is invalid, should be an integer
es: El parámetro de columna no es válido, debe ser un número entero

source: Column parameter is invalid
es: El parámetro de columna no es válido

source: Row parameter is invalid, should be an integer
es: El parámetro de fila no es válido, debe ser un número entero

source: Row parameter is invalid
es: El parámetro de fila no es válido

source: Sequence "%(name)s" by "%(user)s" was captured on %(date)s.
es: La secuencia «%(name)s» del usuario «%(user)s» fue tomada en fecha de %(date)s.

source: GeoVisio collections
es: Colecciones GeoVisio

source: List of collections from this GeoVisio server
es: Lista de colecciones de este servidor GeoVisio

source: Impossible to find token
es: Token no encontrado

source: Impossible to generate a new token
es: No se puede generar un token nuevo

source: Token already claimed by another account
es: El token ha sido reclamado por otra cuenta

source: Impossible to create an UploadSet
es: No se puede crear un UploadSet

source: Parameter for creating an UploadSet should be a valid JSON
es: Los parámetros para crear un UploadSet han de estar en formato JSON válido

source: UploadSet doesn't exist
es: El UploadSet no existe

source: Impossible to parse parameters
es: No se pueden leer los parámetros

source: Parameter `override_capture_time` is not a valid datetime, it should be an iso formated datetime (like '2017-07-21T17:32:28Z').
es: El parámetro `override_capture_time` no es una combinación válida de fecha y hora, debe estar en formato ISO 8601 (por ejemplo, '2017-07-21T17:32:28Z').

source: No file was sent
es: No se envió ningún fichero

source: UploadSet %(u)s does not exist
es: El UploadSet %(u)s no existe

source: You're not authorized to add picture to this upload set
es: No tienes autorización para añadir imágenes a este UploadSet

source: The item has already been added to this upload set
es: Este elemento ya había sido añadido a este UploadSet

source: The same picture has already been sent in a past upload
es: Ya se había subido la misma imagen en una subida anterior

source: You're not authorized to complete this upload set
es: No tienes autorización para completar este UploadSet

source: Impossible to find user
es: No se encuentra el usuario

source: No search parameter given, you should provide `q=<pattern>` as query parameter
es: No se proporcionó ningún parámetro de búsqueda, debes incluir el parámetro `q=<patrón de búsqueda>` en la peetición

source: No default account defined, please contact your instance administrator
es: No se ha definido cuenta por defecto, por favor ponte en contacto con el administrador de la instancia

source: Impossible to find excluded area
es: No se encuentra el área de exclusión

source: The picture is too similar to another one (nearby and taken almost at the same time)
es: La imagen es demasiado similar a otra (cercana y tomada casi en el mismo instante)

source: The picture has invalid EXIF or XMP metadata, making it impossible to use
es: El fichero contiene metadatos EXIF o XMP inválidos, que impiden su uso

source: You must be logged-in as admin to access all excluded areas
es: Has de autenticarte como administrador para acceder a todas las áreas de exclusión

source: Impossible to create an Excluded Area
es: No se puede crear un Área de Exclusión

source: Parameter for creating an Excluded Area should be a valid JSON
es: Los parámetros de creación de un Área de Exclusión deben estar en formato JSON válido

source: You must be logged-in as admin to edit excluded areas
es: Has de autenticarte como administrador para modificar áreas de exclusión

source: You must be logged-in as admin to delete excluded areas
es: Has de autenticarte como administrador para borrar áreas de exclusión

source: The sent file is not a valid JPEG
es: El fichero enviado no es un fichero JPEG válido

source: You're not authorized to list reports
es: No tienes autorización para listar las denuncias

source: You're not authorized to list pictures in this upload set
es: No tienes autorización para listar imágenes de este UploadSet

source: Parameter for replacing all Excluded Areas should be a valid JSON
es: El parámetro para reemplazar todas las Áreas de Exclusión debe estar en formato JSON válido

source: Something went very wrong, but not due to the picture itself
es: Algo se rompió de mala manera, pero el problema no viene de la imagen

source: Impossible to replace all Excluded Areas
es: No se pueden reemplazar todas las Áreas de Exclusión

source: Collection %(s)s wasn't found in database
es: La colección %(s)s no se encuentra en la base de datos

source: You're not authorized to add picture to this collection
es: No estás autorizado a añadir imágenes a esta colección

source: The collection has been deleted, impossible to add pictures to it
es: La colección ha sido borrada, no se le pueden añadir imágenes

source: Picture has invalid metadata
es: La imagen tiene metadatos inválidos

source: Impossible to create a Report
es: No se puede crear una denuncia

source: Parameter for creating a Report should be a valid JSON
es: Los parámetros para crear una denuncia deben estar en formato JSON válido

source: Only authenticated users can access reports
es: Solo pueden acceder a las denuncias los usuarios autenticados

source: Report doesn't exist
es: La denuncia no existe

source: You're not authorized to access this report
es: No estás autorizado para acceder a esta denuncia

source: You're not authorized to access all excluded areas
es: No tienes autorización para acceder a todas las áreas de exclusión

source: You're not authorized to edit this Report
es: No estás autorizado para editar esta denuncia

source: Impossible to edit the Report
es: No se puede editar la denuncia

source: Parameter for editing the Report should be a valid JSON
es: El parámetro para editar la denuncia debe estar en formato JSON válido

source: Impossible to open file as image. The only supported image format is jpg.
es: Imposible abrir el fichero en tanto que imagen. El único formato admitido es jpg.

source: You're not authorized to delete this upload set
es: No tienes autorización para borrar este UploadSet
