Repository: pypi-data/pypi-mirror-372
Catalog: packages/aa-freight/aa_freight-2.0.0.tar.gz/aa_freight-2.0.0/freight/locale/*/LC_MESSAGES/django.po
Languages: ru

source: category
ru: категория

source: solar system
ru: солнечная система

source: Update selected locations from ESI
ru: Обновить выбранные локации через ESI

source: Started updating %d locations. This can take a short while to complete.
ru: Началось обновление %d локаций. Это может занять некоторое время.

source: bidirectional
ru: двунаправленный

source: active
ru: активный

source: default
ru: по умолчанию

source: sync ok
ru: синхронизация ок

source: Fetch contracts from Eve Online server
ru: Получаю контракты с сервера Eve Online

source: Started syncing contracts for: %s
ru: Началась синхронизация контрактов для: %s

source: Send notifications for outstanding contracts
ru: Отправить оповещения о просроченных контрактах

source: Started sending notifications for: %s
ru: Началась отправка оповещений для: %s

source: Update pricing info for all contracts
ru: Обновление стоимости всех контрактов

source: pilots notified
ru: пилоты уведомены

source: customer notified
ru: заказчик уведомлен

source: Sent pilots notification for selected contracts to Discord
ru: Отправить пилотам оповещения о выбранных контрактах в Дискорд

source: Sent pilots notification for contract %d to Discord
ru: Отправить пилотам оповещения о контракте %d в Дискорд

source: Sent customer notification for selected contracts to Discord
ru: Отправить клиенту оповещение о выбранных контрактах в Дискорд

source: Sent customer notification for contract %d to Discord
ru: Отправить клиенту оповещение о контракте %d в Дискорд

source: My Alliance
ru: Мой Альянс

source: My Corporation
ru: Моя Корпорация

source: Corporation in my Alliance
ru: Корпорация в моём Альянсе

source: Corporation public
ru: Публичная корпорация

source: name
ru: имя

source: organization
ru: организация

source: character
ru: персонаж

source: Character used for syncing contracts
ru: Персонажи, использующиеся для синхронизации контрактов

source: operation mode
ru: режим работы

source: price per volume modifier
ru: модификатор цены по объёму

source: Global modifier for price per volume in percent, e.g. 2.5 = +2.5%
ru: Глобальный модификатор цены по объёму, в процентах (например 2.5 = +2.5%)

source: last sync at
ru: последний раз синхронизировано

source: when the last sync happened
ru: когда произошло последняя синхронизация

source: contract handler
ru: держатель контрактов

source: in progress
ru: в процессе

source: finished issuer
ru: завершено заказчиком

source: finished contractor
ru: завершено контрактором

source: finished
ru: завершено

source: canceled
ru: отменено

source: rejected
ru: отклонено

source: failed
ru: провалено

source: deleted
ru: удалено

source: contract ID
ru: ID контракта

source: acceptor
ru: принявший

source: Character of acceptor or None if accepted by corp
ru: Персонаж, принявший контракт, или Нету, если принято корпорацией

source: acceptor corporation
ru: принимающая корпорация

source: Corporation of acceptor
ru: Принимающая корпорация

source: collateral
ru: залог

source: date accepted
ru: дата принятия

source: date completed
ru: дата завершения

source: date notified
ru: дата оповещения

source: days to complete
ru: дней до завершения

source: end location
ru: конечная точка

source: for corporation
ru: для корпорации

source: reward
ru: награда

source: start location
ru: начальная точка

source: status
ru: состояние

source: title
ru: заголовок

source: volume
ru: объём

source: contract
ru: контракт

source: contracts
ru: контракты

source: contract customer notification
ru: оповещение заказчика

source: contract customer notifications
ru: оповещения заказчика

source: location
ru: локация

source: locations
ru: локации

source: collateral minimum
ru: минимальный залог

source: Minimum required collateral in ISK
ru: Минимальный залог в ISK

source: collateral maximum
ru: максимальный залог

source: Maximum allowed collateral in ISK
ru: Максимальный залог в ISK

source: days to expire
ru: дней до истечения контракта

source: Recommended days for contracts to expire
ru: Рекомендованное кол-во дней до истечения контракта

source: Recommended days for contract completion
ru: Рекомендованное кол-во дней до завершения контракта

source: details
ru: подробности

source: is active
ru: активный

source: is default
ru: по умолчанию

source: is bidirectional
ru: двунаправленный

source: price base
ru: базовая цена

source: Base price in ISK
ru: Базовая цена в ISK

source: price minimum
ru: минимальная цена

source: Minimum total price in ISK
ru: Минимальная итоговая цена в ISK

source: price markup from volume
ru: надбавка к цене от объёма

source: Add-on price per m3 volume in ISK
ru: Надбавка к цене за м3 в ISK

source: price markup from collateral
ru: надбавка к цене от залога

source: Add-on price in percent of collateral
ru: Надбавка к цене за залог, в процентах

source: volume maximum
ru: максимальный объём

source: Maximum allowed volume in m3
ru: Максимальный объём в м3

source: volume minimum
ru: минимальный объём

source: Minimum allowed volume in m3
ru: Минимальный объём в м3

source: Add / Update Location
ru: Добавить / обновить локацию

source: Accessing structures with token from %(token_char_name)s
ru: Получение структур по токену от %(token_char_name)s

source: Calculator
ru: Калькулятор

source: Reward
ru: Награда

source: Click To Calculate Reward!
ru: Нажмите чтобы подсчитать награду!

source: Please define a pricing/route!
ru: Пожалуйста определите цену/маршрут!

source: Pricing details
ru: Подробности о ценах

source: From / To:
ru: От / Кому:

source: From:
ru: От:

source: To:
ru: Кому:

source: Both directions:
ru: Оба направления:

source: Minimum price:
ru: Минимальная цена:

source: Fix price:
ru: Фиксированная цена:

source: Base price:
ru: Базовая стоимость:

source: Price add-on per m3:
ru: Надбавка к цене за m3:

source: Price add-on collateral:
ru: Надбавка к цене за залог:

source: Min Volume:
ru: Мин объём:

source: Max Volume:
ru: Макс объём:

source: Min. Collateral:
ru: Мин залог:

source: Max. Collateral:
ru: Макс залог:

source: Additional Instructions:
ru: Дополнительные инструкции:

source: Your contract
ru: Ваши контракты

source: Contract Type:
ru: Тип контракта:

source: Courier
ru: Курьер

source: Availability:
ru: Доступность:

source: Location:
ru: Местоположение:

source: Ship To:
ru: Доставить в:

source: Reward:
ru: Награда:

source: Collateral:
ru: Залог:

source: Expiration:
ru: Срок действия:

source: days
ru: дней

source: Days to complete:
ru: Дней для завершения:

source: Volume:
ru: Объём:

source: Note that this route is bidirectional, so Location and Destination can be switched.
ru: Обратите внимание, что этот маршрут является двунаправленным, поэтому местоположение и пункт назначения можно переключать.

source: No price calculated yet
ru: Цена пока не подсчитана

source: Active
ru: Активно

source: All
ru: Все

source: Status
ru: Состояние

source: Start
ru: Начало

source: Destination
ru: Маршрут

source: Reward ISK
ru: Награда ISK

source: Collateral ISK
ru: Залог ISK

source: Volume m3
ru: Объём м3

source: Contract Check
ru: Проверка

source: Issued On
ru: Создано

source: Expires On
ru: Закончится

source: Issued By
ru: Создано

source: Accepted On
ru: Принято

source: Accepted By
ru: Принято

source: Contract check:
ru: Проверка контракта:

source: Errors
ru: Ошибки

source: If they are errors you find them in the tooltip of icon
ru: Если это ошибки, то вы поймете это по значку

source: No contract check performed
ru: Проверка контракта не произошла

source: Notes:
ru: Дополнительная информация:

source: Color code:
ru: Цветовой код:

source: In Progress
ru: В процессе

source: completed
ru: завершено

source: Toggle navigation
ru: Включить навигацию

source: Reward Calculator
ru: Калькулятор

source: My Contract
ru: Мои контракты

source: All Contracts
ru: Все контракты

source: Statistics
ru: Статистика

source: Add Location
ru: Добавить локацию

source: Routes
ru: Маршруты

source: Pilots
ru: Пилоты

source: Pilot Corporations
ru: Корпорация пилота

source: Customers
ru: Клиенты

source: Name
ru: Имя

source: Contracts
ru: Контракты

source: Rewards
ru: Награды

source: Collaterals
ru: Залоги

source: Volume
ru: Объём

source: Totals
ru: Всего

source: Corporation
ru: Корпорация

source: Alliance
ru: Альянс

source: Statistics calculated for all contracts finished withn the last %(max_days)s days
ru: Статистика подсчитана для всех контрактов, завершенных за последние %(max_days)s дней

source: Setup
ru: Настройка

source: My Contracts
ru: Мои контракты

source: Can not setup contract handler, because %s is not a member of any alliance
ru: Невозможно добавить обработчика контрактов потому, что %s не член альянса

source: You can only use your main or alt characters to setup the contract handler. However, character %s is neither.
ru: Вы можете использовать вашего основного или альт персонажа для добавления обработчика контрактов. Однако, персонаж %s ни то, ни другое.

source: There already is a contract handler installed for a different operation mode. You need to first delete the existing contract handler in the admin section before you can set up this app for a different operation mode.
ru: Для другого режима работы уже установлен обработчик контрактов. Вам необходимо сначала удалить существующий обработчик контрактов в админ-панели, прежде чем вы сможете настроить это приложение для другого режима работы.

source: Contract Handler setup started for %(organization)s organization with %(character)s as sync character. Operation mode: %(operation_mode)s. Started syncing of courier contracts.
ru: Обработчик контрактов добавлен синхронизирующим персонажем %(character)s для организации %(organization)s. Режим работы: %(operation_mode)s. Началась синхронизация курьерских контрактов.

source: Failed to add location with token from %(character)s for location ID %(id)s: %(error)s
ru: Не удалось добавить локацию с токеном от %(character)s для ID локации %(id)s: %(error)s

source: Added:
ru: Добавлено:

source: Updated:
ru: Обновлено:
